{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/storage/work/f/fxl146/Pyramids/append_member_income.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Jan 2022, 00:13:56
{txt}
{com}. 
. local cluster_li_workspace /storage/home/fxl146/scratch/Pyramids_statafiles
{txt}
{com}. 
. 
. forvalues k=2014/2019 {c -(}
{txt}  2{com}. clear
{txt}  3{com}. cd `cluster_li_workspace'
{txt}  4{com}. fs member_income_`k'*.dta
{txt}  5{com}. foreach ff in `r(files)' {c -(}
{txt}  6{com}.     append using `ff'
{txt}  7{com}. {c )-}
{txt}  8{com}. 
. // only these have effective data values. Others only have identifiers.
. keep if response_status=="Accepted"  
{txt}  9{com}. 
. // Because normally Member of the household will only have effective data value
. keep if member_status=="Member of the household"
{txt} 10{com}. 
. // Working age
. drop if age_yr<15
{txt} 11{com}. 
. cd `cluster_li_workspace'
{txt} 12{com}. save member_income_`k', replace
{txt} 13{com}. {c )-}
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20140831_MS_rev.dta{col 36}member_income_20140930_MS_rev.dta
{col 1}member_income_2014.dta{col 36}member_income_20141031_MS_rev.dta
{col 1}member_income_20140131_MS_rev.dta{col 36}member_income_20140630_MS_rev.dta
{col 1}member_income_20141130_MS_rev.dta{col 36}member_income_20141231_MS_rev.dta
{col 1}member_income_20140731_MS_rev.dta{col 36}member_income_20140430_MS_rev.dta
{col 1}member_income_20140531_MS_rev.dta{col 36}member_income_20140331_MS_rev.dta
{col 1}member_income_20140228_MS_rev.dta
{txt}(1,083,062 observations deleted)
(369,532 observations deleted)
(1,599,054 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2014.dta saved
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20150630_MS_rev.dta{col 36}member_income_20150131_MS_rev.dta
{col 1}member_income_20150228_MS_rev.dta{col 36}member_income_20151031_MS_rev.dta
{col 1}member_income_20151130_MS_rev.dta{col 36}member_income_20150831_MS_rev.dta
{col 1}member_income_20150331_MS_rev.dta{col 36}member_income_20150731_MS_rev.dta
{col 1}member_income_2015.dta{col 36}member_income_20150430_MS_rev.dta
{col 1}member_income_20151231_MS_rev.dta{col 36}member_income_20150531_MS_rev.dta
{col 1}member_income_20150930_MS_rev.dta
{txt}{p 0 7 2}
(note: variable
state_of_origin was 
str18, now str25 to accommodate using data's values)
{p_end}
(1,239,525 observations deleted)
(599,774 observations deleted)
(1,385,786 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2015.dta saved
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20160831_MS_rev.dta{col 36}member_income_20160331_MS_rev.dta
{col 1}member_income_20161231_MS_rev.dta{col 36}member_income_20160531_MS_rev.dta
{col 1}member_income_20160930_MS_rev.dta{col 36}member_income_2016.dta
{col 1}member_income_20160229_MS_rev.dta{col 36}member_income_20160131_MS_rev.dta
{col 1}member_income_20160731_MS_rev.dta{col 36}member_income_20160430_MS_rev.dta
{col 1}member_income_20160630_MS_rev.dta{col 36}member_income_20161130_MS_rev.dta
{col 1}member_income_20161031_MS_rev.dta
{txt}{p 0 7 2}
(note: variable
income_of_member_from_interest was 
int, now long to accommodate using data's values)
{p_end}
(1,426,761 observations deleted)
(1,049,894 observations deleted)
(1,349,867 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2016.dta saved
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20170331_MS_rev.dta{col 36}member_income_20170131_MS_rev.dta
{col 1}member_income_20170731_MS_rev.dta{col 36}member_income_20171130_MS_rev.dta
{col 1}member_income_20170228_MS_rev.dta{col 36}member_income_20171231_MS_rev.dta
{col 1}member_income_20170630_MS_rev.dta{col 36}member_income_20170430_MS_rev.dta
{col 1}member_income_2017.dta{col 36}member_income_20170531_MS_rev.dta
{col 1}member_income_20171031_MS_rev.dta{col 36}member_income_20170930_MS_rev.dta
{col 1}member_income_20170831_MS_rev.dta
{txt}{p 0 7 2}
(note: variable
state_of_origin was 
str18, now str25 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
income_of_member_from_dividend was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
member_status was 
str25, now str27 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
income_of_member_from_interest was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
income_of_member_from_fd_pf_insu was 
int, now long to accommodate using data's values)
{p_end}
(1,555,462 observations deleted)
(1,262,107 observations deleted)
(1,247,176 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2017.dta saved
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20180430_MS_rev.dta{col 36}member_income_20180228_MS_rev.dta
{col 1}member_income_20180731_MS_rev.dta{col 36}member_income_20180531_MS_rev.dta
{col 1}member_income_20180630_MS_rev.dta{col 36}member_income_20180331_MS_rev.dta
{col 1}member_income_2018.dta{col 36}member_income_20180131_MS_rev.dta
{txt}(789,221 observations deleted)
(861,356 observations deleted)
(751,335 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2018.dta saved
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{col 1}member_income_20191231_MS_rev.dta{col 36}member_income_20190831_MS_rev.dta
{col 1}member_income_20191130_MS_rev.dta{col 36}member_income_20191031_MS_rev.dta
{col 1}member_income_2019.dta{col 36}member_income_20190930_MS_rev.dta
{txt}(858,732 observations deleted)
(748,600 observations deleted)
(426,417 observations deleted)
{res}/gpfs/scratch/fxl146/Pyramids_statafiles
{txt}file member_income_2019.dta saved

{com}. clear
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. clear
{txt}
{com}. forvalues k=2014/2019{c -(}
{txt}  2{com}.         append using member_income_`k'.dta
{txt}  3{com}. {c )-}
{txt}
{com}. save member_income_1419,replace
{txt}file member_income_1419.dta saved

{com}. timer off 1
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/storage/work/f/fxl146/Pyramids/append_member_income.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Jan 2022, 00:22:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}