
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do clean_trim_merge_append.do 

. 
. clear all 

. set more off

. capture ssc install fs

. 
. 
. local cluster_li_workspace /storage/home/fxl146/scratch/Pyramids_statafiles

. local db_member_income /storage/home/fxl146/scratch/Pyramids_statafiles/membe
> r_income

. local db_people_of_india /storage/home/fxl146/scratch/Pyramids_statafiles/peo
> ple_of_india

. local db_aspirational_india /storage/home/fxl146/scratch/Pyramids_statafiles/
> aspirational_india

. local db_consumption_pyramids /storage/home/fxl146/scratch/Pyramids_statafile
> s/consumption_pyramids

. 
. * I have not done consumption_pyramids_weekly_expense and household income
. 
. * Data disaggregation level
. // member income: hh_id mem_id month_slot month
. // people of india: hh_id mem_id month_slot
. // aspirational : hh_id month_slot (note therefore this is a household-time s
> peicific instead of individual specific dataset)
. // consumption pyramids: hh_id month_slot month (same above)
. 
. 
. 
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_member_income'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. keep if member_status=="Member of the household"
 10. 
. drop if age_yr<15
 11. 
. cd `cluster_li_workspace'
 12. save member_income_`k', replace
 13. }
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20140831_MS_rev.dta  member_income_20140930_MS_rev.dta
member_income_20140131_MS_rev.dta  member_income_20141031_MS_rev.dta
member_income_20141130_MS_rev.dta  member_income_20140630_MS_rev.dta
member_income_20140731_MS_rev.dta  member_income_20141231_MS_rev.dta
member_income_20140531_MS_rev.dta  member_income_20140430_MS_rev.dta
member_income_20140228_MS_rev.dta  member_income_20140331_MS_rev.dta
(1,083,062 observations deleted)
(369,532 observations deleted)
(1,599,054 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20150630_MS_rev.dta  member_income_20150131_MS_rev.dta
member_income_20150228_MS_rev.dta  member_income_20151031_MS_rev.dta
member_income_20151130_MS_rev.dta  member_income_20150831_MS_rev.dta
member_income_20150331_MS_rev.dta  member_income_20150731_MS_rev.dta
member_income_20151231_MS_rev.dta  member_income_20150430_MS_rev.dta
member_income_20150930_MS_rev.dta  member_income_20150531_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(1,239,525 observations deleted)
(599,774 observations deleted)
(1,385,786 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20160831_MS_rev.dta  member_income_20161031_MS_rev.dta
member_income_20161231_MS_rev.dta  member_income_20160331_MS_rev.dta
member_income_20160930_MS_rev.dta  member_income_20160531_MS_rev.dta
member_income_20160229_MS_rev.dta  member_income_20160131_MS_rev.dta
member_income_20160731_MS_rev.dta  member_income_20160430_MS_rev.dta
member_income_20160630_MS_rev.dta  member_income_20161130_MS_rev.dta
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(1,426,761 observations deleted)
(1,049,894 observations deleted)
(1,349,867 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20170331_MS_rev.dta  member_income_20170131_MS_rev.dta
member_income_20170731_MS_rev.dta  member_income_20171130_MS_rev.dta
member_income_20170228_MS_rev.dta  member_income_20171231_MS_rev.dta
member_income_20170630_MS_rev.dta  member_income_20170430_MS_rev.dta
member_income_20171031_MS_rev.dta  member_income_20170531_MS_rev.dta
member_income_20170831_MS_rev.dta  member_income_20170930_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(note: variable income_of_member_from_dividend was int, now long to
       accommodate using data's values)
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(note: variable income_of_member_from_fd_pf_insu was int, now long to
       accommodate using data's values)
(1,555,462 observations deleted)
(1,262,107 observations deleted)
(1,247,176 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20180831_MS_rev.dta  member_income_20180630_MS_rev.dta
member_income_20180930_MS_rev.dta  member_income_20180228_MS_rev.dta
member_income_20180430_MS_rev.dta  member_income_20180531_MS_rev.dta
member_income_20181231_MS_rev.dta  member_income_20181031_MS_rev.dta
member_income_20181130_MS_rev.dta  member_income_20180331_MS_rev.dta
member_income_20180731_MS_rev.dta  member_income_20180131_MS_rev.dta
(1,425,217 observations deleted)
(1,515,373 observations deleted)
(1,262,773 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20190228_MS_rev.dta  member_income_20191031_MS_rev.dta
member_income_20190531_MS_rev.dta  member_income_20190131_MS_rev.dta
member_income_20191231_MS_rev.dta  member_income_20190630_MS_rev.dta
member_income_20190731_MS_rev.dta  member_income_20190430_MS_rev.dta
member_income_20191130_MS_rev.dta  member_income_20190930_MS_rev.dta
member_income_20190831_MS_rev.dta  member_income_20190331_MS_rev.dta
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(1,745,484 observations deleted)
(1,774,255 observations deleted)
(1,103,418 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2019.dta saved

. clear

. 
. 
. forvalues k=2014/2019{
  2.         append using member_income_`k'.dta
  3. }

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |    367,518        1.13        1.13
   Apr 2015 |    435,280        1.34        2.48
   Apr 2016 |    438,500        1.35        3.83
   Apr 2017 |    444,924        1.37        5.20
   Apr 2018 |    475,748        1.47        6.67
   Apr 2019 |    481,592        1.49        8.16
   Apr 2020 |     43,190        0.13        8.29
   Aug 2014 |    438,524        1.35        9.65
   Aug 2015 |    428,500        1.32       10.97
   Aug 2016 |    426,364        1.32       12.28
   Aug 2017 |    422,360        1.30       13.59
   Aug 2018 |    480,984        1.48       15.07
   Aug 2019 |    474,396        1.46       16.54
   Dec 2014 |    425,136        1.31       17.85
   Dec 2015 |    434,700        1.34       19.19
   Dec 2016 |    437,484        1.35       20.54
   Dec 2017 |    469,564        1.45       21.99
   Dec 2018 |    478,348        1.48       23.46
   Dec 2019 |    477,632        1.47       24.94
   Feb 2014 |    119,635        0.37       25.31
   Feb 2015 |    472,740        1.46       26.77
   Feb 2016 |    403,605        1.25       28.01
   Feb 2017 |    434,280        1.34       29.35
   Feb 2018 |    456,776        1.41       30.76
   Feb 2019 |    464,230        1.43       32.20
   Feb 2020 |    357,756        1.10       33.30
   Jan 2015 |    442,805        1.37       34.67
   Jan 2016 |    354,418        1.09       35.76
   Jan 2017 |    418,980        1.29       37.05
   Jan 2018 |    463,024        1.43       38.48
   Jan 2019 |    478,764        1.48       39.96
   Jan 2020 |    465,376        1.44       41.40
   Jul 2014 |    496,841        1.53       42.93
   Jul 2015 |    447,928        1.38       44.31
   Jul 2016 |    442,639        1.37       45.68
   Jul 2017 |    436,200        1.35       47.02
   Jul 2018 |    494,676        1.53       48.55
   Jul 2019 |    495,976        1.53       50.08
   Jun 2014 |    487,550        1.50       51.59
   Jun 2015 |    453,499        1.40       52.99
   Jun 2016 |    445,993        1.38       54.36
   Jun 2017 |    428,964        1.32       55.69
   Jun 2018 |    481,196        1.49       57.17
   Jun 2019 |    470,628        1.45       58.62
   Mar 2014 |    250,468        0.77       59.40
   Mar 2015 |    450,279        1.39       60.79
   Mar 2016 |    432,776        1.34       62.12
   Mar 2017 |    447,984        1.38       63.50
   Mar 2018 |    470,984        1.45       64.96
   Mar 2019 |    497,699        1.54       66.49
   Mar 2020 |    168,414        0.52       67.01
   May 2014 |    414,763        1.28       68.29
   May 2015 |    421,032        1.30       69.59
   May 2016 |    411,224        1.27       70.86
   May 2017 |    409,124        1.26       72.12
   May 2018 |    486,830        1.50       73.63
   May 2019 |    475,396        1.47       75.09
   Nov 2014 |    481,861        1.49       76.58
   Nov 2015 |    442,511        1.37       77.95
   Nov 2016 |    442,676        1.37       79.31
   Nov 2017 |    437,788        1.35       80.66
   Nov 2018 |    492,972        1.52       82.19
   Nov 2019 |    489,980        1.51       83.70
   Oct 2014 |    474,344        1.46       85.16
   Oct 2015 |    435,650        1.34       86.51
   Oct 2016 |    430,996        1.33       87.84
   Oct 2017 |    408,501        1.26       89.10
   Oct 2018 |    476,596        1.47       90.57
   Oct 2019 |    469,164        1.45       92.02
   Sep 2014 |    433,001        1.34       93.35
   Sep 2015 |    408,743        1.26       94.61
   Sep 2016 |    398,264        1.23       95.84
   Sep 2017 |    397,475        1.23       97.07
   Sep 2018 |    476,216        1.47       98.54
   Sep 2019 |    473,412        1.46      100.00
------------+-----------------------------------
      Total | 32,402,346      100.00

. 
. save member_income_1419,replace
file member_income_1419.dta saved

. 
. 
. a
command a is unrecognized
r(199);

end of do-file
r(199);
