
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do csv2dtapyramids.do 

. clear all 

. set more off

. capture ssc install fs

. 
. 
. clear

. capture cd "/storage/home/fxl146/scratch/Pyramids_statafiles/people_of_india"

. 
. fs *.csv
people_of_india_20160101_20160430_R.csv
people_of_india_20140901_20141231_R.csv
people_of_india_20210101_20210430_R.csv
people_of_india_20200901_20201231_R.csv
people_of_india_20140501_20140831_R.csv
people_of_india_20150101_20150430_R.csv
people_of_india_20140101_20140430_R.csv
people_of_india_20150901_20151231_R.csv
people_of_india_20170501_20170831_R.csv
people_of_india_20180501_20180831_R.csv
people_of_india_20170101_20170430_R.csv
people_of_india_20170901_20171231_R.csv
people_of_india_20190101_20190430_R.csv
people_of_india_20200101_20200430_R.csv
people_of_india_20210501_20210831_R.csv
people_of_india_20180901_20181231_R.csv
people_of_india_20160901_20161231_R.csv
people_of_india_20180101_20180430_R.csv
people_of_india_20210901_20211231_R.csv
people_of_india_20160501_20160831_R.csv
people_of_india_20150501_20150831_R.csv
people_of_india_20200501_20200831_R.csv
people_of_india_20190901_20191231_R.csv
people_of_india_20190501_20190831_R.csv

. 
. 
. foreach ff in `r(files)' {
  2.     import delimited `ff', clear
  3.         local name "`=subinstr("`ff'",".csv","",. )'"
  4.         saveold `name', replace
  5. }
(50 vars, 726,924 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20160101_20160430_R.dta saved
(49 vars, 703,605 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20140901_20141231_R.dta saved
(81 vars, 867,822 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20210101_20210430_R.dta saved
(81 vars, 859,608 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20200901_20201231_R.dta saved
(47 vars, 724,240 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20140501_20140831_R.dta saved
(49 vars, 712,841 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20150101_20150430_R.dta saved
(47 vars, 766,198 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20140101_20140430_R.dta saved
(49 vars, 714,709 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20150901_20151231_R.dta saved
(58 vars, 758,511 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20170501_20170831_R.dta saved
(60 vars, 826,388 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20180501_20180831_R.dta saved
(54 vars, 758,865 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20170101_20170430_R.dta saved
(58 vars, 797,626 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20170901_20171231_R.dta saved
(61 vars, 846,864 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20190101_20190430_R.dta saved
(72 vars, 854,355 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20200101_20200430_R.dta saved
(81 vars, 876,006 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20210501_20210831_R.dta saved
(60 vars, 835,532 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20180901_20181231_R.dta saved
(54 vars, 754,978 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20160901_20161231_R.dta saved
(59 vars, 809,128 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20180101_20180430_R.dta saved
(81 vars, 877,049 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20210901_20211231_R.dta saved
(51 vars, 751,913 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20160501_20160831_R.dta saved
(49 vars, 711,628 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20150501_20150831_R.dta saved
(72 vars, 855,808 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20200501_20200831_R.dta saved
(72 vars, 851,786 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20190901_20191231_R.dta saved
(61 vars, 848,874 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file people_of_india_20190501_20190831_R.dta saved

. 
. clear

. capture cd "/storage/home/fxl146/scratch/Pyramids_statafiles/member_income"

. 
. fs *.csv
member_income_20210228_MS_rev.csv  member_income_20190531_MS_rev.csv
member_income_20140228_MS_rev.csv  member_income_20180331_MS_rev.csv
member_income_20160331_MS_rev.csv  member_income_20160229_MS_rev.csv
member_income_20210630_MS_rev.csv  member_income_20210531_MS_rev.csv
member_income_20200229_MS_rev.csv  member_income_20151130_MS_rev.csv
member_income_20161130_MS_rev.csv  member_income_20210831_MS_rev.csv
member_income_20201231_MS_rev.csv  member_income_20150731_MS_rev.csv
member_income_20170331_MS_rev.csv  member_income_20170930_MS_rev.csv
member_income_20180228_MS_rev.csv  member_income_20150331_MS_rev.csv
member_income_20180131_MS_rev.csv  member_income_20201031_MS_rev.csv
member_income_20150228_MS_rev.csv  member_income_20150831_MS_rev.csv
member_income_20200531_MS_rev.csv  member_income_20140430_MS_rev.csv
member_income_20170228_MS_rev.csv  member_income_20150630_MS_rev.csv
member_income_20140331_MS_rev.csv  member_income_20210331_MS_rev.csv
member_income_20161031_MS_rev.csv  member_income_20200831_MS_rev.csv
member_income_20160630_MS_rev.csv  member_income_20190430_MS_rev.csv
member_income_20140630_MS_rev.csv  member_income_20151031_MS_rev.csv
member_income_20190731_MS_rev.csv  member_income_20181130_MS_rev.csv
member_income_20160131_MS_rev.csv  member_income_20180930_MS_rev.csv
member_income_20190228_MS_rev.csv  member_income_20200731_MS_rev.csv
member_income_20190331_MS_rev.csv  member_income_20140731_MS_rev.csv
member_income_20191130_MS_rev.csv  member_income_20180831_MS_rev.csv
member_income_20201130_MS_rev.csv  member_income_20190131_MS_rev.csv
member_income_20190831_MS_rev.csv  member_income_20200131_MS_rev.csv
member_income_20191231_MS_rev.csv  member_income_20160930_MS_rev.csv
member_income_20210131_MS_rev.csv  member_income_20200331_MS_rev.csv
member_income_20190930_MS_rev.csv  member_income_20160731_MS_rev.csv
member_income_20140531_MS_rev.csv  member_income_20160531_MS_rev.csv
member_income_20171231_MS_rev.csv  member_income_20141231_MS_rev.csv
member_income_20170531_MS_rev.csv  member_income_20180531_MS_rev.csv
member_income_20140131_MS_rev.csv  member_income_20150531_MS_rev.csv
member_income_20171031_MS_rev.csv  member_income_20161231_MS_rev.csv
member_income_20160831_MS_rev.csv  member_income_20171130_MS_rev.csv
member_income_20150930_MS_rev.csv  member_income_20210430_MS_rev.csv
member_income_20170831_MS_rev.csv  member_income_20141130_MS_rev.csv
member_income_20140930_MS_rev.csv  member_income_20200430_MS_rev.csv
member_income_20141031_MS_rev.csv  member_income_20170731_MS_rev.csv
member_income_20170430_MS_rev.csv  member_income_20151231_MS_rev.csv
member_income_20150430_MS_rev.csv  member_income_20170630_MS_rev.csv
member_income_20200630_MS_rev.csv  member_income_20140831_MS_rev.csv
member_income_20190630_MS_rev.csv  member_income_20160430_MS_rev.csv
member_income_20170131_MS_rev.csv  member_income_20180731_MS_rev.csv
member_income_20191031_MS_rev.csv  member_income_20181031_MS_rev.csv
member_income_20150131_MS_rev.csv  member_income_20181231_MS_rev.csv
member_income_20200930_MS_rev.csv  member_income_20210731_MS_rev.csv
member_income_20180630_MS_rev.csv  member_income_20180430_MS_rev.csv

. foreach ff in `r(files)' {
  2.     import delimited `ff', clear
  3.         local name "`=subinstr("`ff'",".csv","",. )'"
  4.         saveold `name', replace
  5. }
(42 vars, 871,214 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210228_MS_rev.dta saved
(32 vars, 729,136 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140228_MS_rev.dta saved
(38 vars, 741,273 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160331_MS_rev.dta saved
(42 vars, 877,186 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210630_MS_rev.dta saved
(42 vars, 854,734 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200229_MS_rev.dta saved
(38 vars, 756,517 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20161130_MS_rev.dta saved
(42 vars, 867,822 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20201231_MS_rev.dta saved
(38 vars, 758,418 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170331_MS_rev.dta saved
(41 vars, 816,497 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180228_MS_rev.dta saved
(41 vars, 813,987 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180131_MS_rev.dta saved
(37 vars, 697,809 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150228_MS_rev.dta saved
(42 vars, 856,526 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200531_MS_rev.dta saved
(38 vars, 756,211 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170228_MS_rev.dta saved
(32 vars, 728,994 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140331_MS_rev.dta saved
(38 vars, 755,954 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20161031_MS_rev.dta saved
(38 vars, 757,924 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160630_MS_rev.dta saved
(37 vars, 706,179 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140630_MS_rev.dta saved
(42 vars, 851,361 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190731_MS_rev.dta not found)
file member_income_20190731_MS_rev.dta saved
(38 vars, 727,044 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160131_MS_rev.dta saved
(42 vars, 848,007 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190228_MS_rev.dta not found)
file member_income_20190228_MS_rev.dta saved
(42 vars, 848,356 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190331_MS_rev.dta not found)
file member_income_20190331_MS_rev.dta saved
(42 vars, 854,062 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20191130_MS_rev.dta saved
(42 vars, 866,197 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20201130_MS_rev.dta saved
(42 vars, 851,786 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20190831_MS_rev.dta saved
(42 vars, 854,355 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20191231_MS_rev.dta saved
(42 vars, 867,994 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210131_MS_rev.dta saved
(42 vars, 852,650 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20190930_MS_rev.dta saved
(37 vars, 718,964 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140531_MS_rev.dta saved
(40 vars, 809,128 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20171231_MS_rev.dta saved
(39 vars, 748,272 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170531_MS_rev.dta saved
(32 vars, 736,821 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140131_MS_rev.dta saved
(40 vars, 803,661 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20171031_MS_rev.dta saved
(38 vars, 754,978 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160831_MS_rev.dta saved
(37 vars, 657,006 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150930_MS_rev.dta saved
(39 vars, 797,626 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170831_MS_rev.dta saved
(37 vars, 703,155 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140930_MS_rev.dta saved
(37 vars, 703,890 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20141031_MS_rev.dta saved
(38 vars, 758,511 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170430_MS_rev.dta saved
(37 vars, 711,628 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150430_MS_rev.dta saved
(42 vars, 857,671 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200630_MS_rev.dta saved
(42 vars, 850,574 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190630_MS_rev.dta not found)
file member_income_20190630_MS_rev.dta saved
(38 vars, 759,131 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170131_MS_rev.dta saved
(42 vars, 853,684 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20191031_MS_rev.dta saved
(37 vars, 703,967 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150131_MS_rev.dta saved
(42 vars, 861,854 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200930_MS_rev.dta saved
(41 vars, 830,883 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180630_MS_rev.dta saved
(42 vars, 849,711 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190531_MS_rev.dta not found)
file member_income_20190531_MS_rev.dta saved
(41 vars, 821,153 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180331_MS_rev.dta saved
(38 vars, 730,640 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160229_MS_rev.dta saved
(42 vars, 877,052 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210531_MS_rev.dta saved
(37 vars, 659,290 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20151130_MS_rev.dta saved
(42 vars, 877,049 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210831_MS_rev.dta saved
(37 vars, 708,580 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150731_MS_rev.dta saved
(40 vars, 800,811 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170930_MS_rev.dta saved
(37 vars, 700,381 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150331_MS_rev.dta saved
(42 vars, 863,807 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20201031_MS_rev.dta saved
(37 vars, 714,709 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150831_MS_rev.dta saved
(32 vars, 724,240 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140430_MS_rev.dta saved
(37 vars, 705,681 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150630_MS_rev.dta saved
(42 vars, 873,149 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210331_MS_rev.dta saved
(42 vars, 859,608 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200831_MS_rev.dta saved
(42 vars, 848,874 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190430_MS_rev.dta not found)
file member_income_20190430_MS_rev.dta saved
(37 vars, 641,533 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20151031_MS_rev.dta saved
(42 vars, 843,182 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20181130_MS_rev.dta not found)
file member_income_20181130_MS_rev.dta saved
(42 vars, 837,371 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20180930_MS_rev.dta not found)
file member_income_20180930_MS_rev.dta saved
(42 vars, 858,271 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200731_MS_rev.dta saved
(37 vars, 699,271 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140731_MS_rev.dta saved
(41 vars, 835,532 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20180831_MS_rev.dta not found)
file member_income_20180831_MS_rev.dta saved
(42 vars, 847,316 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20190131_MS_rev.dta not found)
file member_income_20190131_MS_rev.dta saved
(42 vars, 854,560 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200131_MS_rev.dta saved
(38 vars, 756,054 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160930_MS_rev.dta saved
(42 vars, 855,341 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200331_MS_rev.dta saved
(38 vars, 756,256 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160731_MS_rev.dta saved
(38 vars, 757,543 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160531_MS_rev.dta saved
(37 vars, 712,841 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20141231_MS_rev.dta saved
(41 vars, 828,515 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180531_MS_rev.dta saved
(37 vars, 707,312 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20150531_MS_rev.dta saved
(38 vars, 758,865 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20161231_MS_rev.dta saved
(40 vars, 806,562 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20171130_MS_rev.dta saved
(42 vars, 876,006 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210430_MS_rev.dta saved
(37 vars, 704,538 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20141130_MS_rev.dta saved
(42 vars, 855,808 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20200430_MS_rev.dta saved
(39 vars, 757,834 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170731_MS_rev.dta saved
(37 vars, 726,924 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20151231_MS_rev.dta saved
(39 vars, 744,846 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20170630_MS_rev.dta saved
(37 vars, 703,605 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20140831_MS_rev.dta saved
(38 vars, 751,913 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20160430_MS_rev.dta saved
(41 vars, 833,375 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180731_MS_rev.dta saved
(42 vars, 839,957 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20181031_MS_rev.dta not found)
file member_income_20181031_MS_rev.dta saved
(42 vars, 846,864 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file member_income_20181231_MS_rev.dta not found)
file member_income_20181231_MS_rev.dta saved
(42 vars, 877,175 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20210731_MS_rev.dta saved
(41 vars, 826,388 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file member_income_20180430_MS_rev.dta saved

. 
. clear

. capture cd "/storage/home/fxl146/scratch/Pyramids_statafiles/aspirational_ind
> ia"

. 
. fs *.csv
aspirational_india_20170501_20170831_R.csv
aspirational_india_20160901_20161231_R.csv
aspirational_india_20160101_20160430_R.csv
aspirational_india_20200501_20200831_R.csv
aspirational_india_20190901_20191231_R.csv
aspirational_india_20150901_20151231_R.csv
aspirational_india_20190501_20190831_R.csv
aspirational_india_20140901_20141231_R.csv
aspirational_india_20210901_20211231_R.csv
aspirational_india_20160501_20160831_R.csv
aspirational_india_20180901_20181231_R.csv
aspirational_india_20140501_20140831_R.csv
aspirational_india_20140101_20140430_R.csv
aspirational_india_20210101_20210430_R.csv
aspirational_india_20180501_20180831_R.csv
aspirational_india_20190101_20190430_R.csv
aspirational_india_20210501_20210831_R.csv
aspirational_india_20150101_20150430_R.csv
aspirational_india_20180101_20180430_R.csv
aspirational_india_20170101_20170430_R.csv
aspirational_india_20200101_20200430_R.csv
aspirational_india_20150501_20150831_R.csv
aspirational_india_20200901_20201231_R.csv
aspirational_india_20170901_20171231_R.csv

. 
. 
. foreach ff in `r(files)' {
  2.     import delimited `ff', clear
  3.         local name "`=subinstr("`ff'",".csv","",. )'"
  4.         saveold `name', replace
  5. }
(284 vars, 160,847 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20170501_20170831_R.dta saved
(260 vars, 160,511 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20160901_20161231_R.dta saved
(259 vars, 158,624 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20160101_20160430_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20200501_20200831_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20190901_20191231_R.dta saved
(244 vars, 158,624 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20150901_20151231_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20190501_20190831_R.dta saved
(239 vars, 157,442 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20140901_20141231_R.dta saved
(300 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20210901_20211231_R.dta saved
(260 vars, 159,778 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20160501_20160831_R.dta saved
(300 vars, 173,181 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20180901_20181231_R.dta saved
(185 vars, 160,705 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20140501_20140831_R.dta saved
(177 vars, 166,744 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20140101_20140430_R.dta saved
(300 vars, 176,661 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20210101_20210430_R.dta saved
(288 vars, 172,365 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20180501_20180831_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20190101_20190430_R.dta saved
(300 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20210501_20210831_R.dta saved
(239 vars, 158,443 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20150101_20150430_R.dta saved
(288 vars, 169,215 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20180101_20180430_R.dta saved
(284 vars, 161,167 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20170101_20170430_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20200101_20200430_R.dta saved
(239 vars, 158,666 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20150501_20150831_R.dta saved
(300 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20200901_20201231_R.dta saved
(288 vars, 168,165 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file aspirational_india_20170901_20171231_R.dta saved

. 
. clear

. 
. capture cd "/storage/home/fxl146/scratch/Pyramids_statafiles/consumption_pyra
> mids"

. 
. fs *.csv
consumption_pyramids_20160229_MS_rev.csv
consumption_pyramids_20161130_MS_rev.csv
consumption_pyramids_20190531_MS_rev.csv
consumption_pyramids_20201031_MS_rev.csv
consumption_pyramids_20180930_MS_rev.csv
consumption_pyramids_20200831_MS_rev.csv
consumption_pyramids_20140331_MS_rev.csv
consumption_pyramids_20150331_MS_rev.csv
consumption_pyramids_20140430_MS_rev.csv
consumption_pyramids_20180430_MS_rev.csv
consumption_pyramids_20190831_MS_rev.csv
consumption_pyramids_20200131_MS_rev.csv
consumption_pyramids_20210831_MS_rev.csv
consumption_pyramids_20171231_MS_rev.csv
consumption_pyramids_20170930_MS_rev.csv
consumption_pyramids_20201231_MS_rev.csv
consumption_pyramids_20190731_MS_rev.csv
consumption_pyramids_20181031_MS_rev.csv
consumption_pyramids_20140131_MS_rev.csv
consumption_pyramids_20170531_MS_rev.csv
consumption_pyramids_20150630_MS_rev.csv
consumption_pyramids_20181130_MS_rev.csv
consumption_pyramids_20150930_MS_rev.csv
consumption_pyramids_20210430_MS_rev.csv
consumption_pyramids_20150731_MS_rev.csv
consumption_pyramids_20180228_MS_rev.csv
consumption_pyramids_20141130_MS_rev.csv
consumption_pyramids_20150831_MS_rev.csv
consumption_pyramids_20200731_MS_rev.csv
consumption_pyramids_20180131_MS_rev.csv
consumption_pyramids_20210228_MS_rev.csv
consumption_pyramids_20181231_MS_rev.csv
consumption_pyramids_20191031_MS_rev.csv
consumption_pyramids_20151231_MS_rev.csv
consumption_pyramids_20190131_MS_rev.csv
consumption_pyramids_20180531_MS_rev.csv
consumption_pyramids_20151130_MS_rev.csv
consumption_pyramids_20170731_MS_rev.csv
consumption_pyramids_20160531_MS_rev.csv
consumption_pyramids_20190930_MS_rev.csv
consumption_pyramids_20210331_MS_rev.csv
consumption_pyramids_20180331_MS_rev.csv
consumption_pyramids_20180831_MS_rev.csv
consumption_pyramids_20140930_MS_rev.csv
consumption_pyramids_20200630_MS_rev.csv
consumption_pyramids_20141231_MS_rev.csv
consumption_pyramids_20141031_MS_rev.csv
consumption_pyramids_20210731_MS_rev.csv
consumption_pyramids_20140731_MS_rev.csv
consumption_pyramids_20190331_MS_rev.csv
consumption_pyramids_20161031_MS_rev.csv
consumption_pyramids_20170331_MS_rev.csv
consumption_pyramids_20170228_MS_rev.csv
consumption_pyramids_20170430_MS_rev.csv
consumption_pyramids_20201130_MS_rev.csv
consumption_pyramids_20140630_MS_rev.csv
consumption_pyramids_20140531_MS_rev.csv
consumption_pyramids_20171130_MS_rev.csv
consumption_pyramids_20171031_MS_rev.csv
consumption_pyramids_20161231_MS_rev.csv
consumption_pyramids_20160430_MS_rev.csv
consumption_pyramids_20160930_MS_rev.csv
consumption_pyramids_20200331_MS_rev.csv
consumption_pyramids_20190630_MS_rev.csv
consumption_pyramids_20170630_MS_rev.csv
consumption_pyramids_20140831_MS_rev.csv
consumption_pyramids_20210630_MS_rev.csv
consumption_pyramids_20160831_MS_rev.csv
consumption_pyramids_20180630_MS_rev.csv
consumption_pyramids_20170131_MS_rev.csv
consumption_pyramids_20150531_MS_rev.csv
consumption_pyramids_20151031_MS_rev.csv
consumption_pyramids_20190228_MS_rev.csv
consumption_pyramids_20210131_MS_rev.csv
consumption_pyramids_20200229_MS_rev.csv
consumption_pyramids_20170831_MS_rev.csv
consumption_pyramids_20191231_MS_rev.csv
consumption_pyramids_20180731_MS_rev.csv
consumption_pyramids_20200531_MS_rev.csv
consumption_pyramids_20190430_MS_rev.csv
consumption_pyramids_20200930_MS_rev.csv
consumption_pyramids_20140228_MS_rev.csv
consumption_pyramids_20160331_MS_rev.csv
consumption_pyramids_20191130_MS_rev.csv
consumption_pyramids_20210531_MS_rev.csv
consumption_pyramids_20160630_MS_rev.csv
consumption_pyramids_20150430_MS_rev.csv
consumption_pyramids_20160731_MS_rev.csv
consumption_pyramids_20150131_MS_rev.csv
consumption_pyramids_20150228_MS_rev.csv
consumption_pyramids_20160131_MS_rev.csv
consumption_pyramids_20200430_MS_rev.csv

. 
. 
. foreach ff in `r(files)' {
  2.     import delimited `ff', clear
  3.         local name "`=subinstr("`ff'",".csv","",. )'"
  4.         saveold `name', replace
  5. }
(211 vars, 157,480 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160229_MS_rev.dta saved
(211 vars, 160,831 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20161130_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190531_MS_rev.dta saved
(211 vars, 175,413 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20201031_MS_rev.dta saved
(211 vars, 173,261 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180930_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200831_MS_rev.dta saved
(191 vars, 160,414 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140331_MS_rev.dta saved
(208 vars, 155,994 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150331_MS_rev.dta saved
(190 vars, 160,705 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140430_MS_rev.dta saved
(211 vars, 172,365 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180430_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190831_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200131_MS_rev.dta saved
(211 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210831_MS_rev.dta saved
(211 vars, 169,215 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20171231_MS_rev.dta saved
(211 vars, 168,453 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170930_MS_rev.dta saved
(211 vars, 176,661 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20201231_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190731_MS_rev.dta saved
(211 vars, 173,477 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20181031_MS_rev.dta saved
(191 vars, 160,414 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140131_MS_rev.dta saved
(211 vars, 158,730 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170531_MS_rev.dta saved
(208 vars, 157,240 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150630_MS_rev.dta saved
(211 vars, 173,793 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20181130_MS_rev.dta saved
(210 vars, 145,850 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150930_MS_rev.dta saved
(211 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210430_MS_rev.dta saved
(208 vars, 157,544 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150731_MS_rev.dta saved
(211 vars, 170,615 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180228_MS_rev.dta saved
(208 vars, 156,906 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20141130_MS_rev.dta saved
(208 vars, 158,624 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150831_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200731_MS_rev.dta saved
(211 vars, 170,183 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180131_MS_rev.dta saved
(211 vars, 177,541 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210228_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20181231_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20191031_MS_rev.dta saved
(210 vars, 158,624 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20151231_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190131_MS_rev.dta saved
(211 vars, 172,573 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180531_MS_rev.dta saved
(210 vars, 144,618 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20151130_MS_rev.dta saved
(211 vars, 160,045 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170731_MS_rev.dta saved
(211 vars, 160,499 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160531_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190930_MS_rev.dta saved
(211 vars, 178,005 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210331_MS_rev.dta saved
(211 vars, 171,375 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180331_MS_rev.dta saved
(211 vars, 173,181 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180831_MS_rev.dta saved
(208 vars, 157,185 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140930_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200630_MS_rev.dta saved
(208 vars, 158,443 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20141231_MS_rev.dta saved
(208 vars, 157,124 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20141031_MS_rev.dta saved
(211 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210731_MS_rev.dta saved
(212 vars, 156,364 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140731_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190331_MS_rev.dta saved
(211 vars, 160,831 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20161031_MS_rev.dta saved
(211 vars, 160,847 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170331_MS_rev.dta saved
(211 vars, 160,495 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170228_MS_rev.dta saved
(211 vars, 160,847 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170430_MS_rev.dta saved
(211 vars, 176,101 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20201130_MS_rev.dta saved
(212 vars, 157,549 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140630_MS_rev.dta saved
(212 vars, 159,890 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140531_MS_rev.dta saved
(211 vars, 168,959 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20171130_MS_rev.dta saved
(211 vars, 168,719 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20171031_MS_rev.dta saved
(211 vars, 161,167 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20161231_MS_rev.dta saved
(211 vars, 159,778 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160430_MS_rev.dta saved
(211 vars, 160,831 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160930_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200331_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190630_MS_rev.dta saved
(211 vars, 157,674 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170630_MS_rev.dta saved
(208 vars, 157,442 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140831_MS_rev.dta saved
(211 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210630_MS_rev.dta saved
(211 vars, 160,511 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160831_MS_rev.dta saved
(211 vars, 172,781 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180630_MS_rev.dta saved
(211 vars, 161,167 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170131_MS_rev.dta saved
(208 vars, 157,688 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150531_MS_rev.dta saved
(210 vars, 141,402 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20151031_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190228_MS_rev.dta saved
(211 vars, 176,869 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210131_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200229_MS_rev.dta saved
(211 vars, 168,165 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20170831_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20191231_MS_rev.dta saved
(211 vars, 172,989 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20180731_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200531_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20190430_MS_rev.dta saved
(211 vars, 174,901 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200930_MS_rev.dta saved
(191 vars, 159,486 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20140228_MS_rev.dta saved
(211 vars, 158,641 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160331_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20191130_MS_rev.dta saved
(211 vars, 178,677 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20210531_MS_rev.dta saved
(211 vars, 160,465 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160630_MS_rev.dta saved
(208 vars, 158,666 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150430_MS_rev.dta saved
(211 vars, 160,415 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160731_MS_rev.dta saved
(208 vars, 156,613 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150131_MS_rev.dta saved
(208 vars, 155,456 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20150228_MS_rev.dta saved
(211 vars, 157,757 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20160131_MS_rev.dta saved
(211 vars, 174,405 obs)
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file consumption_pyramids_20200430_MS_rev.dta saved

. 
. 
. 
end of do-file
