
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do scale_down_trybatch.do 

. *
. clear

. set more off

. cd "/storage/home/fxl146/scratch/Pyramids_statafiles"
/gpfs/scratch/fxl146/Pyramids_statafiles

. 
. 
. log using "/storage/work/f/fxl146/Pyramids/scale_down_record_batch_correctinc
> ome_year.smcl", replace
(note: file /storage/work/f/fxl146/Pyramids/scale_down_record_batch_correctinco
> me_year.smcl not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /storage/work/f/fxl146/Pyramids/scale_down_record_batch_correctinc
> ome_year.smcl
  log type:  smcl
 opened on:   8 Feb 2022, 19:51:57

. 
. 
. timer clear

. 
. * Random sample
. timer on 1

. use people_of_india_1419.dta,replace

. sample 1
(8,123,080 observations deleted)

. save people_of_india_1419_oneprecent,replace
file people_of_india_1419_oneprecent.dta saved

. use member_income_1419.dta, replace

. sample 1 
(32,078,323 observations deleted)

. save member_income_1419_oneprecent, replace
file member_income_1419_oneprecent.dta saved

. timer off 1

. 
. 
. * Shake off identifiers
. * people_of_india: hh_id mem_id month_slot
. * memeber_income: hh_id mem_id month_slot month
. use member_income_1419, replace

. local extra_identifiers state hr district region_type stratum psu_id response
> _status reason_for_non_response mem_weight_ms mem_weight_for_country_ms mem_w
> eight_for_state_ms mem_non_response_ms mem_non_response_for_country_ms mem_no
> n_response_for_state_ms member_status

. drop `extra_identifiers'

. // Disaggregation level: hh_id mem_id month_slot
. save member_income_1419_nomoreids, replace
file member_income_1419_nomoreids.dta saved

. 
. * Merge and append
. clear

. cd "/storage/home/fxl146/scratch/Pyramids_statafiles"
/gpfs/scratch/fxl146/Pyramids_statafiles

. use member_income_1419_nomoreids,replace

. merge m:1 hh_id mem_id month_slot using people_of_india_1419

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,155,716
        from master                 1,034,736  (_merge==1)
        from using                    120,980  (_merge==2)

    matched                        31,367,610  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(120,980 observations deleted)

. drop _merge

. egen id = group(hh_id mem_id)

. sort hh_id mem_id month_slot month

. order id hh_id mem_id month_slot month

. save concise_1419_labor,replace
file concise_1419_labor.dta saved

. 
. 
. * If works, continue to generate random sample to work with it.
. use concise_1419_labor, replace

. sample 10
(29,162,111 observations deleted)

. save concise_1419_labor_10p,replace
file concise_1419_labor_10p.dta saved

. use concise_1419_labor, replace

. sample 1
(32,078,323 observations deleted)

. save concise_1419_labor_1p,replace
file concise_1419_labor_1p.dta saved

. use concise_1419_labor, replace

. sample 0.1
(32,369,944 observations deleted)

. save concise_1419_labor_01p,replace
file concise_1419_labor_01p.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /storage/work/f/fxl146/Pyramids/scale_down_record_batch_correctinc
> ome_year.smcl
  log type:  smcl
 closed on:   8 Feb 2022, 20:18:22
-------------------------------------------------------------------------------

. 
. 
end of do-file
