
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do scale_down_trybatch.do 

. *
. clear

. set more off

. cd "/storage/home/fxl146/scratch/Pyramids_statafiles"
/gpfs/scratch/fxl146/Pyramids_statafiles

. 
. 
. log using "/storage/work/f/fxl146/Pyramids/scale_down_record_firstbatch.smcl"
> , replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /storage/work/f/fxl146/Pyramids/scale_down_record_firstbatch.smcl
  log type:  smcl
 opened on:  23 Jan 2022, 02:36:57

. 
. 
. timer clear

. 
. * Random sample
. timer on 1

. use people_of_india_1419.dta,replace

. sample 1
(8,123,080 observations deleted)

. save people_of_india_1419_oneprecent,replace
file people_of_india_1419_oneprecent.dta saved

. use member_income_1419.dta, replace

. sample 1 
(52,759,278 observations deleted)

. save member_income_1419_oneprecent, replace
file member_income_1419_oneprecent.dta saved

. timer off 1

. 
. 
. * Shake off identifiers
. * people_of_india: hh_id mem_id month_slot
. * memeber_income: hh_id mem_id month_slot month
. use member_income_1419, replace

. local extra_identifiers state hr district region_type stratum psu_id response
> _status reason_for_non_response mem_weight_ms mem_weight_for_country_ms mem_w
> eight_for_state_ms mem_non_response_ms mem_non_response_for_country_ms mem_no
> n_response_for_state_ms member_status

. drop `extra_identifiers'

. // Disaggregation level: hh_id mem_id month_slot
. save member_income_1419_nomoreids, replace
file member_income_1419_nomoreids.dta saved

. 
. * Merge and append
. clear

. cd "/storage/home/fxl146/scratch/Pyramids_statafiles"
/gpfs/scratch/fxl146/Pyramids_statafiles

. use member_income_1419_nomoreids,replace

. merge m:1 hh_id mem_id month_slot using people_of_india_1419

    Result                           # of obs.
    -----------------------------------------
    not matched                     3,269,855
        from master                 2,069,472  (_merge==1)
        from using                  1,200,383  (_merge==2)

    matched                        51,222,728  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(1,200,383 observations deleted)

. drop _merge

. egen id = group(hh_id mem_id)

. sort hh_id mem_id month_slot month

. order id hh_id mem_id month_slot month

. save concise_1419_labor,replace
file concise_1419_labor.dta saved

. 
. 
. * If works, continue to generate random sample to work with it.
. use concise_1419_labor, replace

. sample 10
(47,962,980 observations deleted)

. save concise_1419_labor_10p,replace
(note: file concise_1419_labor_10p.dta not found)
file concise_1419_labor_10p.dta saved

. use concise_1419_labor, replace

. sample 1
(52,759,278 observations deleted)

. save concise_1419_labor_1p,replace
(note: file concise_1419_labor_1p.dta not found)
file concise_1419_labor_1p.dta saved

. use concise_1419_labor, replace

. sample 0.1
(53,238,908 observations deleted)

. save concise_1419_labor_01p,replace
(note: file concise_1419_labor_01p.dta not found)
file concise_1419_labor_01p.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /storage/work/f/fxl146/Pyramids/scale_down_record_firstbatch.smcl
  log type:  smcl
 closed on:  23 Jan 2022, 03:13:07
-------------------------------------------------------------------------------

. 
. 
. 
. 
. /*
> 
> clear
> cd "/storage/home/fxl146/work/Pyramids/"
> forvalues year=2014/2019{
> use concise_employment_`year',replace
> merge 1:m hh_id mem_id date_m using concise_income_`year'_for_labor_reform
> drop if _merge==2
> rename _merge no_income_record
> replace no_income_record=0 if no_income_record==3
> save temp_concise_`year'_labor_reform,replace
> }
> clear
> forvalues year=2014/2016{
>         display("Now doing `year'")
>         append using temp_concise_`year'_labor_reform
> }
> save concise_1416_labor_reform,replace
> clear
> forvalues year=2017/2019{
>         display("Now doing `year'")
>         append using temp_concise_`year'_labor_reform
> }
> save concise_1719_labor_reform,replace
> clear
> forvalues year=2014/2019{
>         display("Now doing `year'")
>         append using temp_concise_`year'_labor_reform
> }
> save concise_1419_labor_reform,replace
> 
> 
> log close
> 
> * Merge with identifiers
> 
> 
> 
> 
> * Managable random samples
> 
> 
> 
> 
> 
> 
> 
> 
> foreach var in discipline industry_of_occupation income_of_member_from_all_so
> urce income_of_member_from_wages income_of_member_from_pension income_of_memb
> er_from_dividend income_of_member_from_interest {
>         capture gen `var'=.
> }
> count
> forvalues year=2014/2019{
>         duplicates report hh_id mem_id date_m
>  merge 1:m hh_id mem_id date_m using concise_income_`year'_for_labor_reform
>  tab date_m _merge
>  drop if _merge==2
>  drop _merge
> }
> 
> timer off 3
> timer list
> save concise_employment_income_1419,replace
> 
> log close
> 
> 
> 
> 
> 
> */
. 
. 
end of do-file
