
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do clean_trim_merge_append.do 

. 
. clear all 

. set more off

. capture ssc install fs

. 
. 
. local cluster_li_workspace /storage/home/fxl146/scratch/Pyramids_statafiles

. local db_member_income /storage/home/fxl146/scratch/Pyramids_statafiles/membe
> r_income

. local db_people_of_india /storage/home/fxl146/scratch/Pyramids_statafiles/peo
> ple_of_india

. local db_aspirational_india /storage/home/fxl146/scratch/Pyramids_statafiles/
> aspirational_india

. local db_consumption_pyramids /storage/home/fxl146/scratch/Pyramids_statafile
> s/consumption_pyramids

. 
. 
. 
. * I have not done consumption_pyramids_weekly_expense and household income
. 
. 
. 
. * Data disaggregation level
. // member income: hh_id mem_id month_slot month
. // people of india: hh_id mom_id month_slot
. // aspirational : hh_id month_slot (note therefore this is a household-time s
> peicific instead of individual specific dataset)
. // consumption pyramids: hh_id month_slot month (same above)
. 
. 
. 
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_people_of_india'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. // only these have effective data values. Others only have identifiers.
. keep if response_status=="Accepted"  
  9. 
. // Because normally Member of the household will only have effective data val
> ue
. keep if member_status=="Member of the household"
 10. 
. // Working age
. drop if age_yr<15
 11. 
. cd `cluster_li_workspace'
 12. save people_of_india_`k', replace
 13. }
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20140901_20141231_R.dta
people_of_india_20140101_20140430_R.dta
people_of_india_20140501_20140831_R.dta
(272,017 observations deleted)
(94,934 observations deleted)
(413,330 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20150101_20150430_R.dta
people_of_india_20150501_20150831_R.dta
people_of_india_20150901_20151231_R.dta
(311,643 observations deleted)
(137,397 observations deleted)
(363,852 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20160101_20160430_R.dta
people_of_india_20160501_20160831_R.dta
people_of_india_20160901_20161231_R.dta
(357,333 observations deleted)
(240,239 observations deleted)
(342,412 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20170101_20170430_R.dta
people_of_india_20170501_20170831_R.dta
people_of_india_20170901_20171231_R.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(391,423 observations deleted)
(310,123 observations deleted)
(313,438 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20180901_20181231_R.dta
people_of_india_20180101_20180430_R.dta
people_of_india_20180501_20180831_R.dta
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(349,656 observations deleted)
(367,100 observations deleted)
(320,421 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20190501_20190831_R.dta
people_of_india_20190901_20191231_R.dta
people_of_india_20190101_20190430_R.dta
(383,777 observations deleted)
(436,043 observations deleted)
(290,341 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using people_of_india_`k'.dta
  3. }

. save people_of_india_1419,replace
file people_of_india_1419.dta saved

. 
. 
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_member_income'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. keep if member_status=="Member of the household"
 10. 
. drop if age_yr<15
 11. 
. cd `cluster_li_workspace'
 12. save member_income_`k', replace
 13. }
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20140831_MS_rev.dta  member_income_20140930_MS_rev.dta
member_income_20140131_MS_rev.dta  member_income_20141031_MS_rev.dta
member_income_20141130_MS_rev.dta  member_income_20140630_MS_rev.dta
member_income_20140731_MS_rev.dta  member_income_20141231_MS_rev.dta
member_income_20140531_MS_rev.dta  member_income_20140430_MS_rev.dta
member_income_20140228_MS_rev.dta  member_income_20140331_MS_rev.dta
(1,083,062 observations deleted)
(369,532 observations deleted)
(1,599,054 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20150630_MS_rev.dta  member_income_20150131_MS_rev.dta
member_income_20150228_MS_rev.dta  member_income_20151031_MS_rev.dta
member_income_20151130_MS_rev.dta  member_income_20150831_MS_rev.dta
member_income_20150331_MS_rev.dta  member_income_20150731_MS_rev.dta
member_income_20151231_MS_rev.dta  member_income_20150430_MS_rev.dta
member_income_20150930_MS_rev.dta  member_income_20150531_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(1,239,525 observations deleted)
(599,774 observations deleted)
(1,385,786 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20160831_MS_rev.dta  member_income_20161031_MS_rev.dta
member_income_20161231_MS_rev.dta  member_income_20160331_MS_rev.dta
member_income_20160930_MS_rev.dta  member_income_20160531_MS_rev.dta
member_income_20160229_MS_rev.dta  member_income_20160131_MS_rev.dta
member_income_20160731_MS_rev.dta  member_income_20160430_MS_rev.dta
member_income_20160630_MS_rev.dta  member_income_20161130_MS_rev.dta
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(1,426,761 observations deleted)
(1,049,894 observations deleted)
(1,349,867 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20170331_MS_rev.dta  member_income_20170131_MS_rev.dta
member_income_20170731_MS_rev.dta  member_income_20171130_MS_rev.dta
member_income_20170228_MS_rev.dta  member_income_20171231_MS_rev.dta
member_income_20170630_MS_rev.dta  member_income_20170430_MS_rev.dta
member_income_20171031_MS_rev.dta  member_income_20170531_MS_rev.dta
member_income_20170831_MS_rev.dta  member_income_20170930_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(note: variable income_of_member_from_dividend was int, now long to
       accommodate using data's values)
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(note: variable income_of_member_from_fd_pf_insu was int, now long to
       accommodate using data's values)
(1,555,462 observations deleted)
(1,262,107 observations deleted)
(1,247,176 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20180430_MS_rev.dta  member_income_20180531_MS_rev.dta
member_income_20180731_MS_rev.dta  member_income_20180331_MS_rev.dta
member_income_20180630_MS_rev.dta  member_income_20180131_MS_rev.dta
member_income_20180228_MS_rev.dta
(789,221 observations deleted)
(861,356 observations deleted)
(751,335 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20191231_MS_rev.dta  member_income_20191031_MS_rev.dta
member_income_20191130_MS_rev.dta  member_income_20190930_MS_rev.dta
member_income_20190831_MS_rev.dta
(858,732 observations deleted)
(748,600 observations deleted)
(426,417 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using member_income_`k'.dta
  3. }

. save member_income_1419,replace
file member_income_1419.dta saved

. 
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_consumption_pyramids'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. // only these have effective data values. Others only have identifiers.
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save consumption_pyramids_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20140531_MS_rev.dta
consumption_pyramids_20140630_MS_rev.dta
consumption_pyramids_20140131_MS_rev.dta
consumption_pyramids_20140831_MS_rev.dta
consumption_pyramids_20141031_MS_rev.dta
consumption_pyramids_20140731_MS_rev.dta
consumption_pyramids_20140331_MS_rev.dta
consumption_pyramids_20141231_MS_rev.dta
consumption_pyramids_20140930_MS_rev.dta
consumption_pyramids_20140228_MS_rev.dta
consumption_pyramids_20141130_MS_rev.dta
consumption_pyramids_20140430_MS_rev.dta
(note: variable adj_monthly_expense_on_bread was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_eggs was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_intoxican was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_cigarette was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_other_tob was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_potatoes_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medicines was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_fruits was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_remittances_s was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable v44 was int, now long to accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_diesel was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(245,011 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2014.dta not found)
file consumption_pyramids_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20150131_MS_rev.dta
consumption_pyramids_20150331_MS_rev.dta
consumption_pyramids_20150430_MS_rev.dta
consumption_pyramids_20151031_MS_rev.dta
consumption_pyramids_20150228_MS_rev.dta
consumption_pyramids_20151231_MS_rev.dta
consumption_pyramids_20150731_MS_rev.dta
consumption_pyramids_20150630_MS_rev.dta
consumption_pyramids_20150930_MS_rev.dta
consumption_pyramids_20150531_MS_rev.dta
consumption_pyramids_20150831_MS_rev.dta
consumption_pyramids_20151130_MS_rev.dta
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v46 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_food was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_milk_prod was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_emis was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_religious_obl was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_vacation was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(279,583 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2015.dta not found)
file consumption_pyramids_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20160331_MS_rev.dta
consumption_pyramids_20160430_MS_rev.dta
consumption_pyramids_20160731_MS_rev.dta
consumption_pyramids_20161130_MS_rev.dta
consumption_pyramids_20160630_MS_rev.dta
consumption_pyramids_20160930_MS_rev.dta
consumption_pyramids_20160531_MS_rev.dta
consumption_pyramids_20160831_MS_rev.dta
consumption_pyramids_20161031_MS_rev.dta
consumption_pyramids_20160229_MS_rev.dta
consumption_pyramids_20160131_MS_rev.dta
consumption_pyramids_20161231_MS_rev.dta
(note: variable adj_monthly_expense_on_vegetable was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medicines was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_emi_for_vehic was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_ice_cream was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_intoxican was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_cigarette was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_bidis was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(322,669 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2016.dta not found)
file consumption_pyramids_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20170731_MS_rev.dta
consumption_pyramids_20170131_MS_rev.dta
consumption_pyramids_20170531_MS_rev.dta
consumption_pyramids_20170430_MS_rev.dta
consumption_pyramids_20170228_MS_rev.dta
consumption_pyramids_20170831_MS_rev.dta
consumption_pyramids_20170630_MS_rev.dta
consumption_pyramids_20171130_MS_rev.dta
consumption_pyramids_20171231_MS_rev.dta
consumption_pyramids_20170930_MS_rev.dta
consumption_pyramids_20171031_MS_rev.dta
consumption_pyramids_20170331_MS_rev.dta
(note: variable adj_monthly_expense_on_potatoes_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_power_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_remittances_s was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_vacation was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_vegetable was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_autoricks was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_overseas_educ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_petrol_an was int, now long to
       accommodate using data's values)
(note: variable v150 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(341,581 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2017.dta not found)
file consumption_pyramids_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20181130_MS_rev.dta
consumption_pyramids_20180430_MS_rev.dta
consumption_pyramids_20181231_MS_rev.dta
consumption_pyramids_20180331_MS_rev.dta
consumption_pyramids_20180630_MS_rev.dta
consumption_pyramids_20180228_MS_rev.dta
consumption_pyramids_20181031_MS_rev.dta
consumption_pyramids_20180731_MS_rev.dta
consumption_pyramids_20180131_MS_rev.dta
consumption_pyramids_20180831_MS_rev.dta
consumption_pyramids_20180531_MS_rev.dta
consumption_pyramids_20180930_MS_rev.dta
(note: variable adj_monthly_expense_on_fruits was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_private_tuiti was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_power_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electricity was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_clothing was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v47 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(305,541 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2018.dta not found)
file consumption_pyramids_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/consumption_pyramids
consumption_pyramids_20190531_MS_rev.dta
consumption_pyramids_20190630_MS_rev.dta
consumption_pyramids_20190430_MS_rev.dta
consumption_pyramids_20190331_MS_rev.dta
consumption_pyramids_20191231_MS_rev.dta
consumption_pyramids_20190731_MS_rev.dta
consumption_pyramids_20191130_MS_rev.dta
consumption_pyramids_20190228_MS_rev.dta
consumption_pyramids_20190831_MS_rev.dta
consumption_pyramids_20190930_MS_rev.dta
consumption_pyramids_20191031_MS_rev.dta
consumption_pyramids_20190131_MS_rev.dta
(note: variable monthly_expense_on_cereals_and_p was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_whole was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_religious_obl was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_clothing was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_overseas_educ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_enhanc was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_parlor_spa was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v47 was int, now long to accommodate using data's values)
(note: variable adj_monthly_expense_on_milk_prod was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_beverages_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bottled_water was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetic_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetics was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_face_wash was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_scourers was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_diesel was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_private_tuiti was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_restaurants was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_restauran was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_liquor_in_res was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_communication was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cell_phone was int, now long to
       accommodate using data's values)
(370,138 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file consumption_pyramids_2019.dta not found)
file consumption_pyramids_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using consumption_pyramids_`k'.dta
  3. }
(note: variable monthly_expense_on_food was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_restauran was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_food_in_r was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_chocolate was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_ice_cream was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_bidis was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_and_p was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_whole was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electricity was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_biscuits was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_beverages_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bottled_water was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetic_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetics was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_face_wash was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_scourers was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_restaurants was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_liquor_in_res was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_communication was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cell_phone was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_enhanc was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_parlor_spa was int, now long to
       accommodate using data's values)

. save consumption_pyramids_1419,replace
(note: file consumption_pyramids_1419.dta not found)
file consumption_pyramids_1419.dta saved

. 
. 
. 
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_aspirational_india'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. 
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save aspirational_india_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20140901_20141231_R.dta
aspirational_india_20140501_20140831_R.dta
aspirational_india_20140101_20140430_R.dta
(61,417 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2014.dta not found)
file aspirational_india_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20150101_20150430_R.dta
aspirational_india_20150901_20151231_R.dta
aspirational_india_20150501_20150831_R.dta
(70,287 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2015.dta not found)
file aspirational_india_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20160901_20161231_R.dta
aspirational_india_20160101_20160430_R.dta
aspirational_india_20160501_20160831_R.dta
(80,829 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2016.dta not found)
file aspirational_india_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20170101_20170430_R.dta
aspirational_india_20170501_20170831_R.dta
aspirational_india_20170901_20171231_R.dta
(86,639 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2017.dta not found)
file aspirational_india_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20180901_20181231_R.dta
aspirational_india_20180101_20180430_R.dta
aspirational_india_20180501_20180831_R.dta
(note: variable cattle_owned was byte, now int to accommodate using data's
       values)
(75,222 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2018.dta not found)
file aspirational_india_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20190101_20190430_R.dta
aspirational_india_20190901_20191231_R.dta
aspirational_india_20190501_20190831_R.dta
(81,700 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file aspirational_india_2019.dta not found)
file aspirational_india_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using aspirational_india_`k'.dta
  3. }

. save aspirational_india_1419,replace
(note: file aspirational_india_1419.dta not found)
file aspirational_india_1419.dta saved

. 
. 
. 
. 
. 
. 
end of do-file
