
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 5-user network, expiring 15 Nov 2022
Serial number: 501709221209
  Licensed to: The Pennsylvania State University - ICS-ACI
               University Park

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do clean_trim_merge_append.do 

. 
. clear all 

. set more off

. capture ssc install fs

. 
. 
. local cluster_li_workspace /storage/home/fxl146/scratch/Pyramids_statafiles

. 
. local db_member_income /storage/home/fxl146/scratch/Pyramids_statafiles/membe
> r_income

. 
. local db_people_of_india /storage/home/fxl146/scratch/Pyramids_statafiles/peo
> ple_of_india

. 
. local db_aspirational_india /storage/home/fxl146/scratch/Pyramids_statafiles/
> aspirational_india

. 
. local db_household_income /storage/home/fxl146/scratch/Pyramids_statafiles/ho
> usehold_income

. 
. local db_weekly_expense /storage/home/fxl146/scratch/Pyramids_statafiles/week
> ly_expense

. 
. local db_monthly_expense /storage/home/fxl146/scratch/Pyramids_statafiles/mon
> thly_expense

. 
. 
. * Data disaggregation level
. // member income: hh_id mem_id month_slot month
. // people of india: hh_id mem_id month_slot
. // aspirational : hh_id month_slot (note therefore this is a household-time s
> peicific instead of individual specific dataset)
. // household inocme: hh_id month_slot (or month)
. // weekly expense: hh_id month_slot (or month)
. // monthly expense: hh_id month_slot (or month)
. 
. * member income
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_member_income'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. keep if member_status=="Member of the household"
 10. 
. drop if age_yr<15
 11. 
. cd `cluster_li_workspace'
 12. save member_income_`k', replace
 13. }
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20140831_MS_rev.dta  member_income_20140930_MS_rev.dta
member_income_20140131_MS_rev.dta  member_income_20141031_MS_rev.dta
member_income_20141130_MS_rev.dta  member_income_20140630_MS_rev.dta
member_income_20140731_MS_rev.dta  member_income_20141231_MS_rev.dta
member_income_20140531_MS_rev.dta  member_income_20140430_MS_rev.dta
member_income_20140228_MS_rev.dta  member_income_20140331_MS_rev.dta
(1,083,062 observations deleted)
(369,532 observations deleted)
(1,599,054 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20150630_MS_rev.dta  member_income_20150131_MS_rev.dta
member_income_20150228_MS_rev.dta  member_income_20151031_MS_rev.dta
member_income_20151130_MS_rev.dta  member_income_20150831_MS_rev.dta
member_income_20150331_MS_rev.dta  member_income_20150731_MS_rev.dta
member_income_20151231_MS_rev.dta  member_income_20150430_MS_rev.dta
member_income_20150930_MS_rev.dta  member_income_20150531_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(1,239,525 observations deleted)
(599,774 observations deleted)
(1,385,786 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20160831_MS_rev.dta  member_income_20161031_MS_rev.dta
member_income_20161231_MS_rev.dta  member_income_20160331_MS_rev.dta
member_income_20160930_MS_rev.dta  member_income_20160531_MS_rev.dta
member_income_20160229_MS_rev.dta  member_income_20160131_MS_rev.dta
member_income_20160731_MS_rev.dta  member_income_20160430_MS_rev.dta
member_income_20160630_MS_rev.dta  member_income_20161130_MS_rev.dta
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(1,426,761 observations deleted)
(1,049,894 observations deleted)
(1,349,867 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20170331_MS_rev.dta  member_income_20170131_MS_rev.dta
member_income_20170731_MS_rev.dta  member_income_20171130_MS_rev.dta
member_income_20170228_MS_rev.dta  member_income_20171231_MS_rev.dta
member_income_20170630_MS_rev.dta  member_income_20170430_MS_rev.dta
member_income_20171031_MS_rev.dta  member_income_20170531_MS_rev.dta
member_income_20170831_MS_rev.dta  member_income_20170930_MS_rev.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(note: variable income_of_member_from_dividend was int, now long to
       accommodate using data's values)
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(note: variable income_of_member_from_interest was int, now long to
       accommodate using data's values)
(note: variable income_of_member_from_fd_pf_insu was int, now long to
       accommodate using data's values)
(1,555,462 observations deleted)
(1,262,107 observations deleted)
(1,247,176 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20180831_MS_rev.dta  member_income_20180630_MS_rev.dta
member_income_20180930_MS_rev.dta  member_income_20180228_MS_rev.dta
member_income_20180430_MS_rev.dta  member_income_20180531_MS_rev.dta
member_income_20181231_MS_rev.dta  member_income_20181031_MS_rev.dta
member_income_20181130_MS_rev.dta  member_income_20180331_MS_rev.dta
member_income_20180731_MS_rev.dta  member_income_20180131_MS_rev.dta
(1,425,217 observations deleted)
(1,515,373 observations deleted)
(1,262,773 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/member_income
member_income_20190228_MS_rev.dta  member_income_20191031_MS_rev.dta
member_income_20190531_MS_rev.dta  member_income_20190131_MS_rev.dta
member_income_20191231_MS_rev.dta  member_income_20190630_MS_rev.dta
member_income_20190731_MS_rev.dta  member_income_20190430_MS_rev.dta
member_income_20191130_MS_rev.dta  member_income_20190930_MS_rev.dta
member_income_20190831_MS_rev.dta  member_income_20190331_MS_rev.dta
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(1,745,484 observations deleted)
(1,774,255 observations deleted)
(1,103,418 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file member_income_2019.dta saved

. clear

. 
. 
. forvalues k=2014/2019{
  2.         append using member_income_`k'.dta
  3. }

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |    367,518        1.13        1.13
   Apr 2015 |    435,280        1.34        2.48
   Apr 2016 |    438,500        1.35        3.83
   Apr 2017 |    444,924        1.37        5.20
   Apr 2018 |    475,748        1.47        6.67
   Apr 2019 |    481,592        1.49        8.16
   Apr 2020 |     43,190        0.13        8.29
   Aug 2014 |    438,524        1.35        9.65
   Aug 2015 |    428,500        1.32       10.97
   Aug 2016 |    426,364        1.32       12.28
   Aug 2017 |    422,360        1.30       13.59
   Aug 2018 |    480,984        1.48       15.07
   Aug 2019 |    474,396        1.46       16.54
   Dec 2014 |    425,136        1.31       17.85
   Dec 2015 |    434,700        1.34       19.19
   Dec 2016 |    437,484        1.35       20.54
   Dec 2017 |    469,564        1.45       21.99
   Dec 2018 |    478,348        1.48       23.46
   Dec 2019 |    477,632        1.47       24.94
   Feb 2014 |    119,635        0.37       25.31
   Feb 2015 |    472,740        1.46       26.77
   Feb 2016 |    403,605        1.25       28.01
   Feb 2017 |    434,280        1.34       29.35
   Feb 2018 |    456,776        1.41       30.76
   Feb 2019 |    464,230        1.43       32.20
   Feb 2020 |    357,756        1.10       33.30
   Jan 2015 |    442,805        1.37       34.67
   Jan 2016 |    354,418        1.09       35.76
   Jan 2017 |    418,980        1.29       37.05
   Jan 2018 |    463,024        1.43       38.48
   Jan 2019 |    478,764        1.48       39.96
   Jan 2020 |    465,376        1.44       41.40
   Jul 2014 |    496,841        1.53       42.93
   Jul 2015 |    447,928        1.38       44.31
   Jul 2016 |    442,639        1.37       45.68
   Jul 2017 |    436,200        1.35       47.02
   Jul 2018 |    494,676        1.53       48.55
   Jul 2019 |    495,976        1.53       50.08
   Jun 2014 |    487,550        1.50       51.59
   Jun 2015 |    453,499        1.40       52.99
   Jun 2016 |    445,993        1.38       54.36
   Jun 2017 |    428,964        1.32       55.69
   Jun 2018 |    481,196        1.49       57.17
   Jun 2019 |    470,628        1.45       58.62
   Mar 2014 |    250,468        0.77       59.40
   Mar 2015 |    450,279        1.39       60.79
   Mar 2016 |    432,776        1.34       62.12
   Mar 2017 |    447,984        1.38       63.50
   Mar 2018 |    470,984        1.45       64.96
   Mar 2019 |    497,699        1.54       66.49
   Mar 2020 |    168,414        0.52       67.01
   May 2014 |    414,763        1.28       68.29
   May 2015 |    421,032        1.30       69.59
   May 2016 |    411,224        1.27       70.86
   May 2017 |    409,124        1.26       72.12
   May 2018 |    486,830        1.50       73.63
   May 2019 |    475,396        1.47       75.09
   Nov 2014 |    481,861        1.49       76.58
   Nov 2015 |    442,511        1.37       77.95
   Nov 2016 |    442,676        1.37       79.31
   Nov 2017 |    437,788        1.35       80.66
   Nov 2018 |    492,972        1.52       82.19
   Nov 2019 |    489,980        1.51       83.70
   Oct 2014 |    474,344        1.46       85.16
   Oct 2015 |    435,650        1.34       86.51
   Oct 2016 |    430,996        1.33       87.84
   Oct 2017 |    408,501        1.26       89.10
   Oct 2018 |    476,596        1.47       90.57
   Oct 2019 |    469,164        1.45       92.02
   Sep 2014 |    433,001        1.34       93.35
   Sep 2015 |    408,743        1.26       94.61
   Sep 2016 |    398,264        1.23       95.84
   Sep 2017 |    397,475        1.23       97.07
   Sep 2018 |    476,216        1.47       98.54
   Sep 2019 |    473,412        1.46      100.00
------------+-----------------------------------
      Total | 32,402,346      100.00

. 
. save member_income_1419,replace
file member_income_1419.dta saved

. 
. 
. * people of india
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_people_of_india'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. // only these have effective data values. Others only have identifiers.
. keep if response_status=="Accepted"  
  9. 
. // Because normally Member of the household will only have effective data val
> ue
. keep if member_status=="Member of the household"
 10. 
. // Working age
. drop if age_yr<15
 11. 
. cd `cluster_li_workspace'
 12. save people_of_india_`k', replace
 13. }
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20140901_20141231_R.dta
people_of_india_20140101_20140430_R.dta
people_of_india_20140501_20140831_R.dta
(272,017 observations deleted)
(94,934 observations deleted)
(413,330 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20150101_20150430_R.dta
people_of_india_20150501_20150831_R.dta
people_of_india_20150901_20151231_R.dta
(311,643 observations deleted)
(137,397 observations deleted)
(363,852 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20160101_20160430_R.dta
people_of_india_20160501_20160831_R.dta
people_of_india_20160901_20161231_R.dta
(357,333 observations deleted)
(240,239 observations deleted)
(342,412 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20170101_20170430_R.dta
people_of_india_20170501_20170831_R.dta
people_of_india_20170901_20171231_R.dta
(note: variable state_of_origin was str18, now str25 to accommodate using
       data's values)
(391,423 observations deleted)
(310,123 observations deleted)
(313,438 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20180901_20181231_R.dta
people_of_india_20180101_20180430_R.dta
people_of_india_20180501_20180831_R.dta
(note: variable member_status was str25, now str27 to accommodate using
       data's values)
(349,656 observations deleted)
(367,100 observations deleted)
(320,421 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/people_of_india
people_of_india_20190501_20190831_R.dta
people_of_india_20190901_20191231_R.dta
people_of_india_20190101_20190430_R.dta
(383,777 observations deleted)
(436,043 observations deleted)
(290,341 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file people_of_india_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using people_of_india_`k'.dta
  3. }

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |    122,506        1.49        1.49
   Apr 2015 |    108,820        1.33        2.82
   Apr 2016 |    109,625        1.34        4.16
   Apr 2017 |    111,231        1.36        5.51
   Apr 2018 |    118,937        1.45        6.96
   Apr 2019 |    120,398        1.47        8.43
   Aug 2014 |    109,631        1.34        9.76
   Aug 2015 |    107,125        1.31       11.07
   Aug 2016 |    106,591        1.30       12.37
   Aug 2017 |    105,590        1.29       13.66
   Aug 2018 |    120,246        1.47       15.12
   Aug 2019 |    118,599        1.45       16.57
   Dec 2014 |    106,284        1.30       17.86
   Dec 2015 |    108,675        1.32       19.19
   Dec 2016 |    109,371        1.33       20.52
   Dec 2017 |    117,391        1.43       21.95
   Dec 2018 |    119,587        1.46       23.41
   Dec 2019 |    119,408        1.46       24.86
   Feb 2014 |    119,635        1.46       26.32
   Feb 2015 |    118,921        1.45       27.77
   Feb 2016 |    108,479        1.32       29.09
   Feb 2017 |    108,570        1.32       30.42
   Feb 2018 |    114,194        1.39       31.81
   Feb 2019 |    116,085        1.41       33.22
   Jan 2014 |    120,980        1.47       34.70
   Jan 2015 |    111,511        1.36       36.06
   Jan 2016 |    102,180        1.25       37.30
   Jan 2017 |    104,745        1.28       38.58
   Jan 2018 |    115,756        1.41       39.99
   Jan 2019 |    119,744        1.46       41.45
   Jul 2014 |    125,427        1.53       42.98
   Jul 2015 |    112,845        1.38       44.35
   Jul 2016 |    111,100        1.35       45.71
   Jul 2017 |    109,050        1.33       47.03
   Jul 2018 |    123,828        1.51       48.54
   Jul 2019 |    123,994        1.51       50.05
   Jun 2014 |    125,522        1.53       51.58
   Jun 2015 |    114,893        1.40       52.98
   Jun 2016 |    112,238        1.37       54.35
   Jun 2017 |    107,653        1.31       55.66
   Jun 2018 |    120,403        1.47       57.13
   Jun 2019 |    117,657        1.43       58.57
   Mar 2014 |    125,234        1.53       60.09
   Mar 2015 |    112,689        1.37       61.47
   Mar 2016 |    112,766        1.37       62.84
   Mar 2017 |    111,996        1.36       64.21
   Mar 2018 |    117,746        1.44       65.64
   Mar 2019 |    124,490        1.52       67.16
   May 2014 |    108,174        1.32       68.48
   May 2015 |    106,726        1.30       69.78
   May 2016 |    103,497        1.26       71.04
   May 2017 |    102,281        1.25       72.28
   May 2018 |    121,728        1.48       73.77
   May 2019 |    118,849        1.45       75.22
   Nov 2014 |    120,864        1.47       76.69
   Nov 2015 |    110,995        1.35       78.04
   Nov 2016 |    110,669        1.35       79.39
   Nov 2017 |    111,738        1.36       80.75
   Nov 2018 |    123,243        1.50       82.25
   Nov 2019 |    122,495        1.49       83.75
   Oct 2014 |    119,647        1.46       85.21
   Oct 2015 |    110,278        1.34       86.55
   Oct 2016 |    107,749        1.31       87.86
   Oct 2017 |    105,146        1.28       89.14
   Oct 2018 |    119,149        1.45       90.60
   Oct 2019 |    117,291        1.43       92.03
   Sep 2014 |    109,858        1.34       93.37
   Sep 2015 |    102,808        1.25       94.62
   Sep 2016 |     99,566        1.21       95.83
   Sep 2017 |    104,627        1.28       97.11
   Sep 2018 |    119,054        1.45       98.56
   Sep 2019 |    118,353        1.44      100.00
------------+-----------------------------------
      Total |  8,205,131      100.00

. save people_of_india_1419,replace
file people_of_india_1419.dta saved

. 
. 
. 
. * aspirational india
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_aspirational_india'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save aspirational_india_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20140901_20141231_R.dta
aspirational_india_20140501_20140831_R.dta
aspirational_india_20140101_20140430_R.dta
(61,417 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20150101_20150430_R.dta
aspirational_india_20150901_20151231_R.dta
aspirational_india_20150501_20150831_R.dta
(70,287 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20160901_20161231_R.dta
aspirational_india_20160101_20160430_R.dta
aspirational_india_20160501_20160831_R.dta
(80,829 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20170101_20170430_R.dta
aspirational_india_20170501_20170831_R.dta
aspirational_india_20170901_20171231_R.dta
(86,639 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20180901_20181231_R.dta
aspirational_india_20180101_20180430_R.dta
aspirational_india_20180501_20180831_R.dta
(note: variable cattle_owned was byte, now int to accommodate using data's
       values)
(75,222 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/aspirational_india
aspirational_india_20190101_20190430_R.dta
aspirational_india_20190901_20191231_R.dta
aspirational_india_20190501_20190831_R.dta
(81,700 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
file aspirational_india_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using aspirational_india_`k'.dta
  3. }

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |     37,126        1.48        1.48
   Apr 2015 |     33,116        1.32        2.80
   Apr 2016 |     33,588        1.34        4.13
   Apr 2017 |     34,583        1.38        5.51
   Apr 2018 |     36,629        1.46        6.97
   Apr 2019 |     36,955        1.47        8.44
   Aug 2014 |     33,282        1.33        9.77
   Aug 2015 |     33,237        1.32       11.09
   Aug 2016 |     32,472        1.29       12.38
   Aug 2017 |     33,019        1.31       13.70
   Aug 2018 |     36,964        1.47       15.17
   Aug 2019 |     36,980        1.47       16.64
   Dec 2014 |     32,146        1.28       17.92
   Dec 2015 |     33,717        1.34       19.26
   Dec 2016 |     33,753        1.34       20.61
   Dec 2017 |     36,039        1.43       22.04
   Dec 2018 |     36,723        1.46       23.50
   Dec 2019 |     37,186        1.48       24.98
   Feb 2014 |     35,660        1.42       26.40
   Feb 2015 |     35,936        1.43       27.84
   Feb 2016 |     33,492        1.33       29.17
   Feb 2017 |     33,743        1.34       30.51
   Feb 2018 |     35,094        1.40       31.91
   Feb 2019 |     35,306        1.41       33.32
   Jan 2014 |     35,587        1.42       34.73
   Jan 2015 |     32,985        1.31       36.05
   Jan 2016 |     31,145        1.24       37.29
   Jan 2017 |     32,229        1.28       38.57
   Jan 2018 |     35,569        1.42       39.98
   Jan 2019 |     36,429        1.45       41.44
   Jul 2014 |     38,179        1.52       42.96
   Jul 2015 |     34,976        1.39       44.35
   Jul 2016 |     34,050        1.36       45.70
   Jul 2017 |     34,110        1.36       47.06
   Jul 2018 |     37,659        1.50       48.56
   Jul 2019 |     37,908        1.51       50.07
   Jun 2014 |     37,474        1.49       51.56
   Jun 2015 |     35,314        1.41       52.97
   Jun 2016 |     34,433        1.37       54.34
   Jun 2017 |     33,770        1.34       55.68
   Jun 2018 |     37,061        1.48       57.16
   Jun 2019 |     36,325        1.45       58.61
   Mar 2014 |     37,611        1.50       60.10
   Mar 2015 |     34,411        1.37       61.47
   Mar 2016 |     34,683        1.38       62.85
   Mar 2017 |     34,834        1.39       64.24
   Mar 2018 |     35,924        1.43       65.67
   Mar 2019 |     37,638        1.50       67.17
   May 2014 |     31,757        1.26       68.43
   May 2015 |     32,219        1.28       69.72
   May 2016 |     31,444        1.25       70.97
   May 2017 |     31,787        1.27       72.24
   May 2018 |     37,476        1.49       73.73
   May 2019 |     36,655        1.46       75.19
   Nov 2014 |     36,862        1.47       76.65
   Nov 2015 |     34,544        1.38       78.03
   Nov 2016 |     34,306        1.37       79.40
   Nov 2017 |     34,315        1.37       80.76
   Nov 2018 |     37,324        1.49       82.25
   Nov 2019 |     37,422        1.49       83.74
   Oct 2014 |     35,633        1.42       85.16
   Oct 2015 |     33,846        1.35       86.50
   Oct 2016 |     33,714        1.34       87.85
   Oct 2017 |     32,356        1.29       89.13
   Oct 2018 |     36,559        1.46       90.59
   Oct 2019 |     36,212        1.44       92.03
   Sep 2014 |     32,157        1.28       93.31
   Sep 2015 |     31,145        1.24       94.55
   Sep 2016 |     31,004        1.23       95.79
   Sep 2017 |     32,755        1.30       97.09
   Sep 2018 |     36,557        1.46       98.55
   Sep 2019 |     36,499        1.45      100.00
------------+-----------------------------------
      Total |  2,511,598      100.00

. 
. save aspirational_india_1419,replace
file aspirational_india_1419.dta saved

. 
. 
. 
. 
. *household_income
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_household_income'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save household_income_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20140531_MS_rev.dta  household_income_20140831_MS_rev.dta
household_income_20141031_MS_rev.dta  household_income_20140131_MS_rev.dta
household_income_20141231_MS_rev.dta  household_income_20140228_MS_rev.dta
household_income_20140930_MS_rev.dta  household_income_20140630_MS_rev.dta
household_income_20141130_MS_rev.dta  household_income_20140731_MS_rev.dta
household_income_20140331_MS_rev.dta  household_income_20140430_MS_rev.dta
(note: variable income_of_all_members_from_inter was int, now long to
       accommodate using data's values)
(note: variable income_of_household_from_gamblin was int, now long to
       accommodate using data's values)
(245,011 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2014.dta not found)
file household_income_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20150831_MS_rev.dta  household_income_20150331_MS_rev.dta
household_income_20151031_MS_rev.dta  household_income_20150228_MS_rev.dta
household_income_20150630_MS_rev.dta  household_income_20150531_MS_rev.dta
household_income_20151231_MS_rev.dta  household_income_20150930_MS_rev.dta
household_income_20151130_MS_rev.dta  household_income_20150131_MS_rev.dta
household_income_20150430_MS_rev.dta  household_income_20150731_MS_rev.dta
(note: variable income_of_all_members_from_inter was int, now long to
       accommodate using data's values)
(note: variable income_of_household_from_sale_of was int, now long to
       accommodate using data's values)
(279,583 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2015.dta not found)
file household_income_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20161130_MS_rev.dta  household_income_20160831_MS_rev.dta
household_income_20160930_MS_rev.dta  household_income_20160229_MS_rev.dta
household_income_20160331_MS_rev.dta  household_income_20161031_MS_rev.dta
household_income_20160731_MS_rev.dta  household_income_20160430_MS_rev.dta
household_income_20160531_MS_rev.dta  household_income_20160630_MS_rev.dta
household_income_20160131_MS_rev.dta  household_income_20161231_MS_rev.dta
(322,669 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2016.dta not found)
file household_income_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20171130_MS_rev.dta  household_income_20170331_MS_rev.dta
household_income_20171231_MS_rev.dta  household_income_20170430_MS_rev.dta
household_income_20170531_MS_rev.dta  household_income_20170228_MS_rev.dta
household_income_20170630_MS_rev.dta  household_income_20170831_MS_rev.dta
household_income_20170131_MS_rev.dta  household_income_20171031_MS_rev.dta
household_income_20170930_MS_rev.dta  household_income_20170731_MS_rev.dta
(341,581 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2017.dta not found)
file household_income_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20180731_MS_rev.dta  household_income_20180531_MS_rev.dta
household_income_20181031_MS_rev.dta  household_income_20180331_MS_rev.dta
household_income_20180430_MS_rev.dta  household_income_20180831_MS_rev.dta
household_income_20180228_MS_rev.dta  household_income_20180930_MS_rev.dta
household_income_20180131_MS_rev.dta  household_income_20181130_MS_rev.dta
household_income_20181231_MS_rev.dta  household_income_20180630_MS_rev.dta
(305,541 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2018.dta not found)
file household_income_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/household_income
household_income_20191130_MS_rev.dta  household_income_20190228_MS_rev.dta
household_income_20190630_MS_rev.dta  household_income_20190430_MS_rev.dta
household_income_20191031_MS_rev.dta  household_income_20190331_MS_rev.dta
household_income_20190131_MS_rev.dta  household_income_20190831_MS_rev.dta
household_income_20190531_MS_rev.dta  household_income_20190731_MS_rev.dta
household_income_20191231_MS_rev.dta  household_income_20190930_MS_rev.dta
(note: variable income_of_all_members_from_divid was int, now long to
       accommodate using data's values)
(370,138 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file household_income_2019.dta not found)
file household_income_2019.dta saved

. clear

. 
. forvalues k=2014/2019{
  2.         append using household_income_`k'.dta
  3. }

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |    111,378        1.12        1.12
   Apr 2015 |    132,464        1.33        2.46
   Apr 2016 |    134,352        1.35        3.81
   Apr 2017 |    138,332        1.39        5.20
   Apr 2018 |    146,516        1.48        6.68
   Apr 2019 |    147,820        1.49        8.16
   Apr 2020 |     13,294        0.13        8.30
   Aug 2014 |    133,128        1.34        9.64
   Aug 2015 |    132,948        1.34       10.98
   Aug 2016 |    129,888        1.31       12.28
   Aug 2017 |    132,076        1.33       13.61
   Aug 2018 |    147,856        1.49       15.10
   Aug 2019 |    147,920        1.49       16.59
   Dec 2014 |    128,584        1.29       17.89
   Dec 2015 |    134,868        1.36       19.24
   Dec 2016 |    135,012        1.36       20.60
   Dec 2017 |    144,156        1.45       22.06
   Dec 2018 |    146,892        1.48       23.53
   Dec 2019 |    148,744        1.50       25.03
   Feb 2014 |     35,660        0.36       25.39
   Feb 2015 |    142,799        1.44       26.83
   Feb 2016 |    124,166        1.25       28.08
   Feb 2017 |    134,972        1.36       29.44
   Feb 2018 |    140,376        1.41       30.85
   Feb 2019 |    141,196        1.42       32.27
   Feb 2020 |    111,081        1.12       33.39
   Jan 2015 |    131,033        1.32       34.71
   Jan 2016 |    107,666        1.08       35.79
   Jan 2017 |    128,916        1.30       37.09
   Jan 2018 |    142,276        1.43       38.53
   Jan 2019 |    145,658        1.47       39.99
   Jan 2020 |    144,432        1.45       41.45
   Jul 2014 |    151,133        1.52       42.97
   Jul 2015 |    138,902        1.40       44.37
   Jul 2016 |    135,691        1.37       45.73
   Jul 2017 |    136,440        1.37       47.11
   Jul 2018 |    150,435        1.51       48.62
   Jul 2019 |    151,632        1.53       50.15
   Jun 2014 |    145,403        1.46       51.61
   Jun 2015 |    139,588        1.41       53.02
   Jun 2016 |    136,841        1.38       54.39
   Jun 2017 |    134,616        1.36       55.75
   Jun 2018 |    148,108        1.49       57.24
   Jun 2019 |    145,300        1.46       58.70
   Mar 2014 |     75,222        0.76       59.46
   Mar 2015 |    137,505        1.38       60.85
   Mar 2016 |    133,074        1.34       62.19
   Mar 2017 |    139,336        1.40       63.59
   Mar 2018 |    143,696        1.45       65.04
   Mar 2019 |    150,478        1.52       66.55
   Mar 2020 |     51,720        0.52       67.07
   May 2014 |    121,639        1.22       68.30
   May 2015 |    127,250        1.28       69.58
   May 2016 |    124,991        1.26       70.84
   May 2017 |    127,148        1.28       72.12
   May 2018 |    149,872        1.51       73.62
   May 2019 |    146,620        1.48       75.10
   Nov 2014 |    146,993        1.48       76.58
   Nov 2015 |    137,789        1.39       77.97
   Nov 2016 |    137,224        1.38       79.35
   Nov 2017 |    134,427        1.35       80.70
   Nov 2018 |    149,296        1.50       82.21
   Nov 2019 |    149,688        1.51       83.71
   Oct 2014 |    141,314        1.42       85.14
   Oct 2015 |    133,792        1.35       86.48
   Oct 2016 |    134,856        1.36       87.84
   Oct 2017 |    125,635        1.26       89.11
   Oct 2018 |    146,236        1.47       90.58
   Oct 2019 |    144,848        1.46       92.04
   Sep 2014 |    126,762        1.28       93.31
   Sep 2015 |    123,857        1.25       94.56
   Sep 2016 |    124,016        1.25       95.81
   Sep 2017 |    124,042        1.25       97.06
   Sep 2018 |    146,228        1.47       98.53
   Sep 2019 |    145,996        1.47      100.00
------------+-----------------------------------
      Total |  9,932,098      100.00

. 
. save household_income_1419,replace
(note: file household_income_1419.dta not found)
file household_income_1419.dta saved

. 
. 
. 
. 
. * weekly expense
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_weekly_expense'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save weekly_expense_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20140501_20140831_R.dta
consumption_pyramids_20140901_20141231_R.dta
consumption_pyramids_20140101_20140430_R.dta
(note: variable occupation_group was str36, now str37 to accommodate using
       data's values)
(note: variable weekly_expense_on_edible_oils was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_fruits was int, now long to accommodate
       using data's values)
(note: variable weekly_expense_on_meat_eggs_and_ was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_autorickshaw_a was int, now long to
       accommodate using data's values)
(61,417 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2014.dta not found)
file weekly_expense_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20150101_20150430_R.dta
consumption_pyramids_20150901_20151231_R.dta
consumption_pyramids_20150501_20150831_R.dta
(note: variable weekly_expense_on_food_in_restau was int, now long to
       accommodate using data's values)
(70,287 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2015.dta not found)
file weekly_expense_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20160501_20160831_R.dta
consumption_pyramids_20160101_20160430_R.dta
consumption_pyramids_20160901_20161231_R.dta
(80,829 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2016.dta not found)
file weekly_expense_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20170101_20170430_R.dta
consumption_pyramids_20170501_20170831_R.dta
consumption_pyramids_20170901_20171231_R.dta
(86,639 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2017.dta not found)
file weekly_expense_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20180901_20181231_R.dta
consumption_pyramids_20180101_20180430_R.dta
consumption_pyramids_20180501_20180831_R.dta
(75,222 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2018.dta not found)
file weekly_expense_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/weekly_expense
consumption_pyramids_20190901_20191231_R.dta
consumption_pyramids_20190501_20190831_R.dta
consumption_pyramids_20190101_20190430_R.dta
(note: variable weekly_expense_on_potatoes_and_o was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_biscuits was int, now long to accommodate
       using data's values)
(note: variable weekly_expense_on_meat_eggs_and_ was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_meat_and_fish was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_petrol_and_die was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_petrol_and_cng was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_autorickshaw_a was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_diesel was int, now long to accommodate
       using data's values)
(81,700 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file weekly_expense_2019.dta not found)
file weekly_expense_2019.dta saved

. 
. clear

. 
. forvalues k=2014/2019{
  2.         append using weekly_expense_`k'
  3. }
(note: variable weekly_expense_on_potatoes_and_o was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_food_in_restau was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_bidis was int, now long to accommodate
       using data's values)
(note: variable weekly_expense_on_biscuits was int, now long to accommodate
       using data's values)
(note: variable weekly_expense_on_meat_and_fish was int, now long to
       accommodate using data's values)
(note: variable weekly_expense_on_diesel was int, now long to accommodate
       using data's values)

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |     37,126        1.48        1.48
   Apr 2015 |     33,116        1.32        2.80
   Apr 2016 |     33,588        1.34        4.13
   Apr 2017 |     34,583        1.38        5.51
   Apr 2018 |     36,629        1.46        6.97
   Apr 2019 |     36,955        1.47        8.44
   Aug 2014 |     33,282        1.33        9.77
   Aug 2015 |     33,237        1.32       11.09
   Aug 2016 |     32,472        1.29       12.38
   Aug 2017 |     33,019        1.31       13.70
   Aug 2018 |     36,964        1.47       15.17
   Aug 2019 |     36,980        1.47       16.64
   Dec 2014 |     32,146        1.28       17.92
   Dec 2015 |     33,717        1.34       19.26
   Dec 2016 |     33,753        1.34       20.61
   Dec 2017 |     36,039        1.43       22.04
   Dec 2018 |     36,723        1.46       23.50
   Dec 2019 |     37,186        1.48       24.98
   Feb 2014 |     35,660        1.42       26.40
   Feb 2015 |     35,936        1.43       27.84
   Feb 2016 |     33,492        1.33       29.17
   Feb 2017 |     33,743        1.34       30.51
   Feb 2018 |     35,094        1.40       31.91
   Feb 2019 |     35,306        1.41       33.32
   Jan 2014 |     35,587        1.42       34.73
   Jan 2015 |     32,985        1.31       36.05
   Jan 2016 |     31,145        1.24       37.29
   Jan 2017 |     32,229        1.28       38.57
   Jan 2018 |     35,569        1.42       39.98
   Jan 2019 |     36,429        1.45       41.44
   Jul 2014 |     38,179        1.52       42.96
   Jul 2015 |     34,976        1.39       44.35
   Jul 2016 |     34,050        1.36       45.70
   Jul 2017 |     34,110        1.36       47.06
   Jul 2018 |     37,659        1.50       48.56
   Jul 2019 |     37,908        1.51       50.07
   Jun 2014 |     37,474        1.49       51.56
   Jun 2015 |     35,314        1.41       52.97
   Jun 2016 |     34,433        1.37       54.34
   Jun 2017 |     33,770        1.34       55.68
   Jun 2018 |     37,061        1.48       57.16
   Jun 2019 |     36,325        1.45       58.61
   Mar 2014 |     37,611        1.50       60.10
   Mar 2015 |     34,411        1.37       61.47
   Mar 2016 |     34,683        1.38       62.85
   Mar 2017 |     34,834        1.39       64.24
   Mar 2018 |     35,924        1.43       65.67
   Mar 2019 |     37,638        1.50       67.17
   May 2014 |     31,757        1.26       68.43
   May 2015 |     32,219        1.28       69.72
   May 2016 |     31,444        1.25       70.97
   May 2017 |     31,787        1.27       72.24
   May 2018 |     37,476        1.49       73.73
   May 2019 |     36,655        1.46       75.19
   Nov 2014 |     36,862        1.47       76.65
   Nov 2015 |     34,544        1.38       78.03
   Nov 2016 |     34,306        1.37       79.40
   Nov 2017 |     34,315        1.37       80.76
   Nov 2018 |     37,324        1.49       82.25
   Nov 2019 |     37,422        1.49       83.74
   Oct 2014 |     35,633        1.42       85.16
   Oct 2015 |     33,846        1.35       86.50
   Oct 2016 |     33,714        1.34       87.85
   Oct 2017 |     32,356        1.29       89.13
   Oct 2018 |     36,559        1.46       90.59
   Oct 2019 |     36,212        1.44       92.03
   Sep 2014 |     32,157        1.28       93.31
   Sep 2015 |     31,145        1.24       94.55
   Sep 2016 |     31,004        1.23       95.79
   Sep 2017 |     32,755        1.30       97.09
   Sep 2018 |     36,557        1.46       98.55
   Sep 2019 |     36,499        1.45      100.00
------------+-----------------------------------
      Total |  2,511,598      100.00

. 
. save weekly_expense_1419,replace
(note: file weekly_expense_1419.dta not found)
file weekly_expense_1419.dta saved

. 
. 
. 
. 
. 
. * monthly expense
. 
. clear

. forvalues k=2014/2019 {
  2. clear
  3. cd `db_monthly_expense'
  4. fs *`k'*.dta
  5. foreach ff in `r(files)' {
  6.     append using `ff'
  7. }
  8. 
. keep if response_status=="Accepted"  
  9. 
. cd `cluster_li_workspace'
 10. save monthly_expense_`k', replace
 11. }
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20140531_MS_rev.dta
consumption_pyramids_20140630_MS_rev.dta
consumption_pyramids_20140131_MS_rev.dta
consumption_pyramids_20140831_MS_rev.dta
consumption_pyramids_20141031_MS_rev.dta
consumption_pyramids_20140731_MS_rev.dta
consumption_pyramids_20140331_MS_rev.dta
consumption_pyramids_20141231_MS_rev.dta
consumption_pyramids_20140930_MS_rev.dta
consumption_pyramids_20140228_MS_rev.dta
consumption_pyramids_20141130_MS_rev.dta
consumption_pyramids_20140430_MS_rev.dta
(note: variable adj_monthly_expense_on_bread was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_eggs was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_intoxican was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_cigarette was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_other_tob was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_potatoes_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medicines was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_fruits was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_remittances_s was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable v44 was int, now long to accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_diesel was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(245,011 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2014.dta not found)
file monthly_expense_2014.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20150131_MS_rev.dta
consumption_pyramids_20150331_MS_rev.dta
consumption_pyramids_20150430_MS_rev.dta
consumption_pyramids_20151031_MS_rev.dta
consumption_pyramids_20150228_MS_rev.dta
consumption_pyramids_20151231_MS_rev.dta
consumption_pyramids_20150731_MS_rev.dta
consumption_pyramids_20150630_MS_rev.dta
consumption_pyramids_20150930_MS_rev.dta
consumption_pyramids_20150531_MS_rev.dta
consumption_pyramids_20150831_MS_rev.dta
consumption_pyramids_20151130_MS_rev.dta
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v46 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_food was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_milk_prod was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_emis was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_religious_obl was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_vacation was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(279,583 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2015.dta not found)
file monthly_expense_2015.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20160331_MS_rev.dta
consumption_pyramids_20160430_MS_rev.dta
consumption_pyramids_20160731_MS_rev.dta
consumption_pyramids_20161130_MS_rev.dta
consumption_pyramids_20160630_MS_rev.dta
consumption_pyramids_20160930_MS_rev.dta
consumption_pyramids_20160531_MS_rev.dta
consumption_pyramids_20160831_MS_rev.dta
consumption_pyramids_20161031_MS_rev.dta
consumption_pyramids_20160229_MS_rev.dta
consumption_pyramids_20160131_MS_rev.dta
consumption_pyramids_20161231_MS_rev.dta
(note: variable adj_monthly_expense_on_vegetable was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medicines was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_emi_for_vehic was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_ice_cream was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_intoxican was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_cigarette was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_bidis was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_mobiles_and_a was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(322,669 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2016.dta not found)
file monthly_expense_2016.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20170731_MS_rev.dta
consumption_pyramids_20170131_MS_rev.dta
consumption_pyramids_20170531_MS_rev.dta
consumption_pyramids_20170430_MS_rev.dta
consumption_pyramids_20170228_MS_rev.dta
consumption_pyramids_20170831_MS_rev.dta
consumption_pyramids_20170630_MS_rev.dta
consumption_pyramids_20171130_MS_rev.dta
consumption_pyramids_20171231_MS_rev.dta
consumption_pyramids_20170930_MS_rev.dta
consumption_pyramids_20171031_MS_rev.dta
consumption_pyramids_20170331_MS_rev.dta
(note: variable adj_monthly_expense_on_potatoes_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_power_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_remittances_s was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_vacation was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_vegetable was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_autoricks was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_overseas_educ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_petrol_an was int, now long to
       accommodate using data's values)
(note: variable v150 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_edible_oi was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_other_taxes was int, now long to
       accommodate using data's values)
(341,581 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2017.dta not found)
file monthly_expense_2017.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20181130_MS_rev.dta
consumption_pyramids_20180430_MS_rev.dta
consumption_pyramids_20181231_MS_rev.dta
consumption_pyramids_20180331_MS_rev.dta
consumption_pyramids_20180630_MS_rev.dta
consumption_pyramids_20180228_MS_rev.dta
consumption_pyramids_20181031_MS_rev.dta
consumption_pyramids_20180731_MS_rev.dta
consumption_pyramids_20180131_MS_rev.dta
consumption_pyramids_20180831_MS_rev.dta
consumption_pyramids_20180531_MS_rev.dta
consumption_pyramids_20180930_MS_rev.dta
(note: variable adj_monthly_expense_on_fruits was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_eggs was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_outstation_ta was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_private_tuiti was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_power_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electricity was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_motor_vehicle was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_clothing was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v47 was int, now long to accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_domestic_help was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_others_educat was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(305,541 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2018.dta not found)
file monthly_expense_2018.dta saved
/gpfs/scratch/fxl146/Pyramids_statafiles/monthly_expense
consumption_pyramids_20190531_MS_rev.dta
consumption_pyramids_20190630_MS_rev.dta
consumption_pyramids_20190430_MS_rev.dta
consumption_pyramids_20190331_MS_rev.dta
consumption_pyramids_20191231_MS_rev.dta
consumption_pyramids_20190731_MS_rev.dta
consumption_pyramids_20191130_MS_rev.dta
consumption_pyramids_20190228_MS_rev.dta
consumption_pyramids_20190831_MS_rev.dta
consumption_pyramids_20190930_MS_rev.dta
consumption_pyramids_20191031_MS_rev.dta
consumption_pyramids_20190131_MS_rev.dta
(note: variable monthly_expense_on_cereals_and_p was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_whole was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bills_and_ren was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_house_rent was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_doctors_physi was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_religious_obl was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_mithai was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_clothing was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_kitchen_appli was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_books_journal was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_school_academ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_overseas_educ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_enhanc was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_parlor_spa was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_milk_and_ was int, now long to
       accommodate using data's values)
(note: variable v47 was int, now long to accommodate using data's values)
(note: variable adj_monthly_expense_on_milk_prod was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_beverages_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bottled_water was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetic_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetics was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_face_wash was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_scourers was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_diesel was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_private_tuiti was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_medical_tests was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_restaurants was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_additional_pr was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_insura was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_restauran was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_liquor_in_res was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_emi_for_durab was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_communication was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cell_phone was int, now long to
       accommodate using data's values)
(370,138 observations deleted)
/gpfs/scratch/fxl146/Pyramids_statafiles
(note: file monthly_expense_2019.dta not found)
file monthly_expense_2019.dta saved

. 
. clear

. 
. forvalues k=2014/2019{
  2.         append using monthly_expense_`k'
  3. }
(note: variable monthly_expense_on_food was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_salty_sna was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_restauran was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_food_in_r was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_lighting was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pets was int, now long to accommodate
       using data's values)
(note: variable adj_monthly_expense_on_chocolate was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_ice_cream was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_meat_and_ was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_bidis was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_bags_wallets_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_recreation was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electronic_st was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_professional_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_general_insur was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_utensils was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_pocket_money was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_and_p was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cereals_whole was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_artificial_je was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_power_and_fue was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_electricity was int, now long to
       accommodate using data's values)
(note: variable adj_monthly_expense_on_biscuits was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_beverages_and was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_bottled_water was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetic_and_ was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cosmetics was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_face_wash was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_scourers was int, now long to accommodate
       using data's values)
(note: variable monthly_expense_on_restaurants was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_liquor_in_res was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_communication was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_cell_phone was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_health_enhanc was int, now long to
       accommodate using data's values)
(note: variable monthly_expense_on_parlor_spa was int, now long to
       accommodate using data's values)

. tab month_slot

 MONTH_SLOT |      Freq.     Percent        Cum.
------------+-----------------------------------
   Apr 2014 |    111,378        1.12        1.12
   Apr 2015 |    132,464        1.33        2.46
   Apr 2016 |    134,352        1.35        3.81
   Apr 2017 |    138,332        1.39        5.20
   Apr 2018 |    146,516        1.48        6.68
   Apr 2019 |    147,820        1.49        8.16
   Apr 2020 |     13,294        0.13        8.30
   Aug 2014 |    133,128        1.34        9.64
   Aug 2015 |    132,948        1.34       10.98
   Aug 2016 |    129,888        1.31       12.28
   Aug 2017 |    132,076        1.33       13.61
   Aug 2018 |    147,856        1.49       15.10
   Aug 2019 |    147,920        1.49       16.59
   Dec 2014 |    128,584        1.29       17.89
   Dec 2015 |    134,868        1.36       19.24
   Dec 2016 |    135,012        1.36       20.60
   Dec 2017 |    144,156        1.45       22.06
   Dec 2018 |    146,892        1.48       23.53
   Dec 2019 |    148,744        1.50       25.03
   Feb 2014 |     35,660        0.36       25.39
   Feb 2015 |    142,799        1.44       26.83
   Feb 2016 |    124,166        1.25       28.08
   Feb 2017 |    134,972        1.36       29.44
   Feb 2018 |    140,376        1.41       30.85
   Feb 2019 |    141,196        1.42       32.27
   Feb 2020 |    111,081        1.12       33.39
   Jan 2015 |    131,033        1.32       34.71
   Jan 2016 |    107,666        1.08       35.79
   Jan 2017 |    128,916        1.30       37.09
   Jan 2018 |    142,276        1.43       38.53
   Jan 2019 |    145,658        1.47       39.99
   Jan 2020 |    144,432        1.45       41.45
   Jul 2014 |    151,133        1.52       42.97
   Jul 2015 |    138,902        1.40       44.37
   Jul 2016 |    135,691        1.37       45.73
   Jul 2017 |    136,440        1.37       47.11
   Jul 2018 |    150,435        1.51       48.62
   Jul 2019 |    151,632        1.53       50.15
   Jun 2014 |    145,403        1.46       51.61
   Jun 2015 |    139,588        1.41       53.02
   Jun 2016 |    136,841        1.38       54.39
   Jun 2017 |    134,616        1.36       55.75
   Jun 2018 |    148,108        1.49       57.24
   Jun 2019 |    145,300        1.46       58.70
   Mar 2014 |     75,222        0.76       59.46
   Mar 2015 |    137,505        1.38       60.85
   Mar 2016 |    133,074        1.34       62.19
   Mar 2017 |    139,336        1.40       63.59
   Mar 2018 |    143,696        1.45       65.04
   Mar 2019 |    150,478        1.52       66.55
   Mar 2020 |     51,720        0.52       67.07
   May 2014 |    121,639        1.22       68.30
   May 2015 |    127,250        1.28       69.58
   May 2016 |    124,991        1.26       70.84
   May 2017 |    127,148        1.28       72.12
   May 2018 |    149,872        1.51       73.62
   May 2019 |    146,620        1.48       75.10
   Nov 2014 |    146,993        1.48       76.58
   Nov 2015 |    137,789        1.39       77.97
   Nov 2016 |    137,224        1.38       79.35
   Nov 2017 |    134,427        1.35       80.70
   Nov 2018 |    149,296        1.50       82.21
   Nov 2019 |    149,688        1.51       83.71
   Oct 2014 |    141,314        1.42       85.14
   Oct 2015 |    133,792        1.35       86.48
   Oct 2016 |    134,856        1.36       87.84
   Oct 2017 |    125,635        1.26       89.11
   Oct 2018 |    146,236        1.47       90.58
   Oct 2019 |    144,848        1.46       92.04
   Sep 2014 |    126,762        1.28       93.31
   Sep 2015 |    123,857        1.25       94.56
   Sep 2016 |    124,016        1.25       95.81
   Sep 2017 |    124,042        1.25       97.06
   Sep 2018 |    146,228        1.47       98.53
   Sep 2019 |    145,996        1.47      100.00
------------+-----------------------------------
      Total |  9,932,098      100.00

. 
. save monthly_expense_1419,replace
(note: file monthly_expense_1419.dta not found)
file monthly_expense_1419.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file
